[
{
  "title": "Tours",
  "body": "== Current Dates ==08/28 Milo Columbus, OH08/29 Beachland Ballroom Cleveland, OH08/30 William Pitt Union Assembly Pittsburgh, PA08/31 Crofoot Pontiac, MI09/02 Lee’s Palace Toronto, ON,CAN09/03 La Sala Rossa Montreal, QC,CAN09/04 Iron Horse Music Hall Northampton, MA09/05 Middle East Boston, MA09/06 Music Hall of Williamsburg Brooklyn, NY09/07 Bowery Ballroom New York, NY09/09 First Unitarian Church Philadelphia, PA09/10 Black Cat Washington, DC09/11 Cat’s Cradle Carrboro, NC09/12 Grey Eagle Asheville, NC09/13 Horizon Records/Bohemian Cafe Greenville, SC09/13 Variety Playhouse Atlanta, GA09/14 Jack Rabbits Jacksonville, FL09/15 The Social Orlando, FL09/16 Club Downunder Tallahassee, FL09/17 One Eyed Jack’s New Orleans, LA09/18 Walter’s on Washington Houston, TX09/19 Emo’s Austin, TX09/20 Hailey’s Denton, TX09/21 http://www.online-casino-gaming.org - pay pal casino09/22 Plush Tucson, AZ09/23 Casbah San Diego, CA09/26 Echoplex Los Angeles, CA09/27 Fernwood Resort Big Sur, CA09/30 Wonder Ballroom Portland, OR10/02 Neumo’s Seattle, WA10/03 Neurolux Boise, ID10/04 Urban Lounge Salt Lake City, UT10/05 Bluebird Theater Denver, CO10/07 Waiting Room Lounge Omaha, NE10/08 Triple Rock Social Club Minneapolis, MN10/09 Picador Iowa City, IA10/10 Metro Chicago, IL10/11 Birdy’s Indianapolis, IN10/12 Exit/In Nashville, TN== Past Dates ==You can click on some of the past tour dates for setlists and other details.||{B}Date ||{B}City ||{B}Venue |||| ((The 40 Watt, Athens, GA, 10th March 2006|Fri Mar 10)) || Athens, GA || The 40 Watt |||| ((The Earl, 11th March 2006|Sat Mar 11)) || Atlanta GA || The Earl |||| ((Grey Eagle Tavern & Music Hall, 12th March 2006|Sun Mar 12)) || Asheville NC || Grey Eagle Tavern & Music Hall |||| ((Cat's Cradle, Carrboro NC, March 2006|Tue Mar 14)) || Carrboro NC || Cat's Cradle |||| ((Satellite Ballroom, Charlottesville, 16th March 2006|Thu Mar 16)) || Charlottesville VA || Satellite Ballroom || || ((Webster Hall, New York, 17th March 2006|Fri Mar 17)) || New York NY || Webster Hall |||| ((Webster Hall, New York, 18th March 2006|Sat Mar 18)) || New York NY || Webster Hall |||| ((Middle East Club, Massachusetts, 19th March 2006|Sun Mar 19)) || Cambridge MA || Middle East Club Downstairs || || ((Starlight Ballroom, Philadelphia PA, 21st March 2006|Tue Mar 21)) || Philadelphia PA || Starlight Ballroom || || ((Ottobar, Baltimore MD, 22nd March 2006|Wed Mar 22)) || Baltimore MD || Ottobar || || ((Little Brothers, Columbus, 24th March 2006|Fri Mar 24)) || Columbus OH || Little Brothers || || ((Blind Pig, Ann Arbor, 25th March 2006|Sat Mar 25)) || Ann Arbor MI || Blind Pig || || Thu Apr 13 || Bloomington IN || Bluebird |||| ((Double Door, Chicago, IL, 14 April 2006|Fri Apr 14)) || Chicago, IL || Double Door |||| Sat Apr 15 || Madison, WI || High Noon Saloon |||| Mon Apr 24 || London, England || Scala |||| Tue Apr 25 || London, England || Scala |||| ((The Bongo Club, Edinburgh, 27th April 2006|Thu Apr 27)) || Edinburgh, Scotland || The Bongo Club (Triptych Festival) |||| ((Tramway Theatre, Glasgow, 28th April 2006|Fri Apr 28)) || Glasgow, Scotland || Tramway Theatre (Triptych Festival) |||| Fri Jun 23 || Umbertide, Italy || Rockin Umbertide Festival |||| Sat Jun 24 || Corbetta, Italy || Corbetta Berafest |||| Mon Jun 26 || Barcelona, Spain || Pocket Club |||| Tue Jun 27 || Toulouse, France || Puerto Habana |||| Thu Jun 29 || Mo'Fo Fest || Paris, France |||| Sat Jul 1 || Roskilde, Denmark || Roskilde Festival |||| Mon Jul 3 || Malmö, Sweden || w/ Accelerator Festival |||| Wed Jul 5 || Göteborg, Sweden || w/ Accelerator Festival |||| Thu Jul 6 || Stockholm, Sweden || w/ Accelerator Festival |||| Fri Jul 7 || Borlange, Sweden || Peace and Love Festival |||| Sat Jul 8 || Kristiansand, Norway || Trash Pop w/ Quart Fest |||| Thu Jul 10 || Tel Aviv, Israel || Mayumana House |||| Thu Jul 11 || Tel Aviv, Israel || The Patiphone |||| ((Club Academy Manchester, 13th July 2006 |Thu Jul 13)) || Manchester, UK || Academy|||| Fri Jul 14 || Cardiff, UK || the Point |||| Sat Jul 15 || London, UK || Mean Fiddler |||| Fri Jul 28 || St. Louis MO || The Duck Room |||| Sat Jul 29 || Chicago, IL || Union Park w/ Pitchfork Music Fest |||| Sat Aug 19 || Powys, Wales || The Greenman Festival |||| Wed Sept 6 || Vancouver, BC || Richards on Richards |||| Thu Sept 7 || Seattle,WA || Showbox |||| Sun Sept 10 || San Francisco, CA || Mezzanine |||| ((Fonda Theatre, Los Angeles, 12th Sept 2006 |Tue Sept 12)) || Los Angeles, CA || Henry Fonda Theater ||"
},
{
  "title": "Cat's Cradle, March 2006",
  "body": "== Setlist ==Please add the setlist here.== Review ==Please and a review here.== Videos ==[http://youtube.com/watch?v=EKbSvHtmNFA Slow Education video]"
},
{
  "title": "Cat's Cradle, Carrboro NC, March 2006",
  "body": "== Setlist ==Please add the setlist here.== Review ==Please and a review here.== Videos ==[http://youtube.com/watch?v=EKbSvHtmNFA Slow Education video]"
},
{
  "title": "Blind Pig, Ann Arbor, 25th March 2006",
  "body": "From: http://www.thunderdowncountry.com/2006/03/26/silver-jews-ann-arbor-325/http://www.umich.edu/~zshoup/blog/DCBandCassie.jpg== Setlist ==Pet Politics\\Getting Back Into Getting Back Into You\\Slow Education\\Animal Shapes\\The Poor, the Fair, and the Good\\Horseleg Swastikas\\Trains Across the Sea\\Inside the Golden Days of Missing You\\Random Rules\\How Can I Love You if You Won't Lie Down?\\Dallas\\Sleeping is the Only Love\\Smith and Jones Forever\\There is a Place\\Black and Brown Blues\\Punks in the Beerlight\\Buckingham Rabbit\\Sometimes a Pony Gets Depressed== Review ==I can safely say that this was my favorite concert ever. Not the best, to be sure, but my favorite. In the weeks leading up to the tour, I was deeply concerned that even if the tour got off the ground without some sort of David Berman meltdown, the band was going to sound unrehearsed and sloppy. The tapes of the first two shows alleviated some of those fears - they actually sounded pretty solid. But the difference between the band that people in Athens and Atlanta saw and the band I saw last night is just huge. They sounded great. And it seems like DCB is getting more and more comfortable with playing shows. I love how he surrounded himself with his wife Cassie and old friends Bob Nostanovich and Steve West from Pavement. The whole concept of this tour is uplifiting. He's coming off some of the darkest years of his life, battling hard drugs and suicide, pulls himself out of it, records a great album, and hits the road with his loved ones to try to get his life back on track. It was really special to be a part of that, and the mood of the crowd reflected that. Nearly everyone was a devoted fan and knew every song. I got to the Blind Pig around 9, 30 minutes before doors opened, and there were easily over a hundred people already waiting in line.The energy in the room leading up to the show was palpable, and after two solid opening songs, it just exploded during \"Slow Education\", which was the highlight of the show for me. It's a great song in any context, but the band just fucking nailed it last night, slide guitar and all. And given that \"uplifting\" atmosphere I was talking about, to have them play one of their most uplifting and reassuring songs early on was amazing. I'm pleased that they've been playing \"Animal Shapes\" lately, too. I think it's one of the strongest songs on Tanglewood Numbers. \"Smith and Jones Forever\" lived up to all of its potential to be a singalong anthem. \"Black and Brown Blues\", which is quickly becoming one of my favorite songs, was good to hear, even if DCB strangely chose to mumble incoherently rather than sing the last verse.Only complaint: no \"Rebel Jew\", despite my screaming for it. I know they haven't been playing it, but a guy can hope, right?After the show, we hit the merchandise table where I was faced with the choice of a small or XL red shirt, as opposed to the pink medium I wanted. I went with the small, which may have been a mistake, but such is life. The venue booted us after a few minutes of hanging around waiting to meet DCB. We moved outside, and after a while, Bob Nostanovich came out and started to talk to us. It was pretty amazing to talk about Pavement with him. Of note, he absolutely guaranteed that Pavement would be back together in 2-3 years. I guess Malk just had a kid and is about to get married and wants to take some time off. He also said that the Joos are going to keep touring indefinitely. There was a guy from Toronto talking with us and Bob assured him that there will be a Toronto show in a few months. He even asked the guy what venue they should play; he suggested the Horseshoe Tavern. We also learned that there will be occasional shows with Malkmus in the future, but that he will never join the tour. \"It's like battle of the biggest egos when Malkmus and David are in the same room\". Then he got distracted and started talking about the Kentucky Derby…Finally, after about an hour, DCB came out. He was actually trying to figure out what the fuck Bob was doing, and luckily there were only a few diehard fans to accost him. I managed to get a picture with him.http://www.umich.edu/~zshoup/blog/ZachDCB.jpg"
},
{
  "title": "Satellite Ballroom, Charlottesville, 16th March 2006",
  "body": "== Setlist ==Black and Brown Blues\\Animal Shapes\\Buckingham Rabbit\\Trains Across the Sea\\Dallas\\I’m Getting Back Into Getting Back Into You\\New Orleans\\How Can I Love You (If You Won’t Lie Down)?\\Horseleg Swastikas\\Random Rules\\Smith and Jones Forever\\How to Rent a Room\\Slow Education\\The Poor, the Fair, and the GoodEncore:\\Punks in the Beerlight\\Inside the Golden Days of Missing You\\There is a Place"
},
{
  "title": "Little Brothers, Columbus, 24th March 2006",
  "body": "== Setlist ==Black and Brown Blues\\Animal Shapes\\Smith & Jones Forever\\Sleeping Is The Only Love\\Dallas\\Trains Across The Sea\\Slow Education\\Pet Politics\\I'm Getting Back Into Getting Back Into You\\How Can I Love You (If You Won't Lie Down)?\\Horseleg Swastikas\\Inside the Golden Days of Missing You\\There is a Place\\The Poor, the Fair, and the Good\\Punks in the BeerlightEncore:\\Random Rules\\Sometimes a Pony Gets Depressed"
},
{
  "title": "The Bongo Club, Edinburgh, 27th April 2006",
  "body": "== Setlist ==(the order is wrong - please correct if you can)\\Random Rules\\Smith and Jones Forever\\Slow Education\\How to Rent a Room\\Trains Across The Sea\\How Can I Love You If You Won't Lie Down\\Horseleg Swastikas\\Animal Shapes\\Pet Politics\\Dallas\\O Captain! My Captain!\\There Is A Place\\Sometimes a Pony Gets Depressed\\Black and Brown BluesEncore:Punks In The Beerlight== Photos ==* http://florian13.f2s.com/SilverJews/Edinburgh"
},
{
  "title": "Tramway Theatre, Glasgow, 28th April 2006",
  "body": "== Setlist ==(the order is wrong - please correct it if you can)Trains Across The Sea\\New Orleans\\How to Rent a Room\\Black and Brown Blues\\Dallas\\Inside The Golden Days Of Missing You\\Random Rules\\Smith and Jones Forever\\Slow Education\\Time Will Break the World\\Horseleg Swastikas\\How Can I Love You If You Won't Lie Down\\Sometimes a Pony Gets Depressed\\Sleeping is the Only Love\\I'm Getting Back Into Getting Back Into You \\Animal Shapes\\The Poor, The Fair and The Good\\Punks In The Beerlight\\There Is A Place== Photos ==* http://florian13.f2s.com/SilverJews/Glasgow"
},
{
  "title": "New York, 18th March 2006",
  "body": "== Setlist ==not in order:Im getting back\\Sometimes a pony\\O captain my captain (Walt Whitman cover)\\Animal shapes\\Rent a room\\Trains across the sea\\How can I love you\\Smith and jones\\Dallas\\Horseleg swastikas\\Slow education\\Random rules\\Poor fair good\\Sleeping is the only love\\Pretty eyes=== Encore ===Pet politics\\Punks in beerlight"
},
{
  "title": "Webster Hall, New York, 18th March 2006",
  "body": "== Setlist ==(not in order)\\I'm getting back\\Sometimes a pony\\O captain my captain (Walt Whitman cover)\\Animal shapes\\Rent a room\\Trains across the sea\\How can I love you\\Smith and jones\\Dallas\\Horseleg swastikas\\Slow education\\Random rules\\Poor fair good\\Sleeping is the only love\\Pretty eyesEncore:\\Pet politics\\Punks in beerlight"
},
{
  "title": "Club Acadmey Manchester, 13th July 2006 ",
  "body": "Supportted by Marble Valley== Set List  == (not in right order and just from memory):Black and Brown Blues\\Animal Shapes\\Sleeping is the only love\\Punks in the bearlight\\Smith & Jones\\How can I love you when you won't lie down\\I'm getting back into getting back into you\\Random Rules\\Dallas\\Slow Education\\Horseleg Swastikas\\Sometimes a pony gets depressed\\New Orleans\\Trains across the Sea\\There is a place"
},
{
  "title": "Club Academy Manchester, 13th July 2006 ",
  "body": "Support by Marble Valley== Set List  == (not in right order and just from memory):Black and Brown Blues\\Animal Shapes\\Sleeping is the only love\\Punks in the bearlight\\Smith and Jones Forever\\How can I love you when you won't lie down\\I'm getting back into getting back into you\\Random Rules\\Dallas\\Time will break the world\\Slow Education\\Horseleg Swastikas\\Sometimes a pony gets depressed\\New Orleans\\Trains across the Sea\\There is a place"
},
{
  "title": "Webster Hall, New York, 17th March 2006",
  "body": "== Setlist? ==Slow Education\\Smith and Jones\\Animal Shapes\\Random Rules\\Dallas\\Horseleg Swastikas\\Black and Brown Blues\\Trains Across the Sea\\How Can I Love You If You Won't Lie Down\\Buckingham Rabbit\\How to Rent a Room\\Pet Politics\\The Poor, The Fair and The Good\\Sometimes a Pony Gets Depressed\\Punks in the BeerlightEncore:\\There is a Place"
},
{
  "title": "Middle East Club, Massachusetts, 19th March 2006",
  "body": "== Setlist ==http://www.bradleysalmanac.com/pictures/2006-04/sjsetlist.jpgBlack and Brown Blues\\Animal Shapes\\Smith and Jones Forever\\Pet Politics\\Buckingham Rabbit\\Trains Across the Sea\\How Can I Love You If You Won't Lie Down\\How to Rent a Room\\I'm Getting Back into Getting Back into You\\Random Rules\\Horseleg Swastikas\\The Poor, The Fair and The GoodEncore:\\Slow Education\\There is a Place\\Punks in the Beerlight\\I Loved them Every OneMP3s are avaiable from here: http://www.bradleysalmanac.com/2006/04/mp3s-silver-jews-in-cambridge-ma.htm== Review ==From http://www.bradleysalmanac.com/2006/04/mp3s-silver-jews-in-cambridge-ma.htm:As DC Berman said from the stage when he and his Silver Jews came to town a few weeks back: \"It's not a once in a lifetime thing...\". Before this first ever Joos tour, most of us figured it'd be a \"not in our lifetime\" thing, but Berman, his wife Cassie, and some musical friends made it happen. Only took him 15 years or so, and he even promised they'd return to these parts again.Until then, or until another Silver Jews album arrives, here's something to hold onto... the entire set from their show at The Middle East in Cambridge, MA. It was the 8th night of the tour, and according to someone there who'd also seen the two previous NY shows, it was a night that they really came together as a 'band'. I've got nothing to compare it to, but it all worked for me.The only real drawback? People, of course. While most of the sold-out crowd was there to see and hear the something special, there seemed to be a disproportionate number who were there to be seen and heard, who'd read that it was 'the place to be', and spent the set both jibbering and jabbering. You'll hear what I mean when you listen to the mp3s... there's a constant buzz of conversation throughout.Fortunately the mix helps mightily. The usual difficulty of mixing in the confines of the low-ceilinged Middle East downstairs was overcome by their touring soundman, who just happened to be Pavement drummer Steve West. I thought I recognized him when checking to see if it was cool to record the show (and of course, it was), and sure enough, he was along for the trip. Definitely explains why the drum sounds, which can be the first things to get lost in a sometimes-muddy MidEast mix, come through pretty damn clear. This equal-parts Joos & Pavement fan got a little kick out of seeing West behind the board when his ex-bandmate (and now tour manager) Bob Nostanovich came on stage to drum on a couple songs. I've loved \"Trains Across The Sea\" for what seems like forever, and having him play his original part was a real treat.http://static.flickr.com/34/116151475_c65c978683.jpgFrom http://false45th.blogspot.com/2006/03/silver-jews-middle-east-mar-19th.html:There are certain things in life that I've always accepted as fact regardless of whether they are true absolutes...I'm never going to be the centerfielder for the Yankees, Preki is going to shoot with his left foot, Yo La Tengo is going to close their main set with \"Blue Line Swinger\" or \"I Heard You Looking\", I'm never going to be a millionaire, etc. I just accept things like this and move on.Well, a few months ago, I included \"I'll never see the Silver Jews play live\" on that list. However, after last Sunday night I could erase that one from the board...and erase it with vigor. I had seen the Joos blow through an hour plus set and promise to come back for more.I was meeting a my brother-in-law, sister-in-law and friend in Cambridge for dinner and the show. So, I made the trek down solo as I battled all of the weekend skiers heading home to Boston. It wasn't too bad though because I made the trip in a breezy 2 hours and 40 minutes. By the way, it's amazing how few VT plates you see on I-89 on late Sunday afternoons in the winter.After meeting my friends, we grabbed some dinner at Central Kitchen. Good food and the mussels were pretty friggin' fantastic. Plus, it was right across the street from Middle East which made it very convenient. After dinner, I said goodbye to my brother-in-law and sister-in-law and headed down to the Miracle of Science Bar with my friend for a few pre-show beers. The idea of the bar is that it's set up as a school science lab. MIT is right down the street...Get it! Actually, it was a good spot to have a beer before seeing Mr. BermanWe managed to make it into Middle East about halfway through Ketman's set. Apparently, the band's bass player is the brother of David Berman's wife, Cassie. Regarding their music, let me put it this way...without the nepotism, Ketman wouldn't have gotten a whiff of an opening slot at a sold out show at Middle East. They're some sort of metal-inspired mush-mouth indie rock trio.Since Ketman wasn't doing anything for me, I took the opportunity to step out for a second. Thankfully, when I came back they were gone. So, my friend and I took a moment to check out the merchandise table. That's where I found former Pavement drummer Steve West hanging out. He looked just like he did during the Pavement years. So, I asked him if he was Steve West, thank him for a lot of great music and asked him if he was playing drums tonight. He said he was just doing sound for the tour. I never knew Westie was a sound guy but, considering Berman's situation, it's probably best that he packs the tour with as many friends as possible.By the way, Pavement's other former drummer/moogist, Bob Nastanovich, was the MC for the evening (along with a comedian). Nastanovich also looked like he hadn't aged a day since Pavement broke up. Good to see so they won't look so akward when Pavement eventually gets around to a reunion tour. Bob even snuck on stage and reprised his wild back-up vocals role for Berman during the main set closer \"There Is a Place\".I forgot the name of the comedian who assisted Bob with the MC duties. However, he was largely lame. His best line was saying that CNN's Christiana Amanpour looks like an amalgamation of all The Rolling Stones.New Radiant Storm Kings took the stage next. I haven't listened to these guys since 1996's August Revital. They still sounded good but since their sound isn't wildly different than a lot of indie rock bands, they are probably a lot more enjoyable if you are familiar with their songs. Nothing compellingly ground-breaking but good well-built tunes from a tight band.Sometime during NRSK's set, I saw David Berman pop out of the side door with a guitar case slung over his shoulder like he had just arrived. Considering all of the demons he's battled over the years, I was happy to actually see him at the show. When you never thought you'd see a guy play live and then learn that he's been battling addictions and depression, you are never 100% certain that you are going to hear him perform until you actually see him in the club.A short while later, Berman took the stage with a five piece band including his wife Cassie on bass. The crowd cheered mightily like a long lost friend had just entered the room. It had a much more personal welcome to it than the usual band appearence.Berman had a music stand to the side of him with lyrics sheets. As he explained, he needs the stand since his memory isn't very good any more and his eyesight is poor. The post-show review in the Boston Globe said the music stand placed a barrier between Berman and the audience. However, that is friggin' simplistic and idiotic. The fact is that, as my friend pointed out, it made him appear vulnerable which has always been an underlying theme to his music. It immediately gave you the sense that you wanted to root for the guy to have a good show and slay his demons.His set touched each album except for the obscure Arizona and Dime Reef Map records. I can never remember all of the songs from a show (particularly a week later) but he knocked out, \"Trains Across the Sea\", \"Black and Brown Blues\", \"Random Rules\", \"Smith & Jones Forever\", \"Buckingham Rabbit\", \"Horseleg Swatsika\", \"Pet Politics\", \"Punks In the Beerlight\", \"Animal Shapes\", \"There Is a Place\" and \"How Can I Love You (If You Won't Lie Down)\". Berman also stepped off the stage for a moment while Cassie sang, \"The Poor, The Fair, And the Good\".Berman's voice was it's usual deep monotone self which sounded great to a Joos' fan's ears. The band was nothing spectactular but did a good job with the tunes. Besides the music, the fun part of the show was watching Berman grow in confidence throughout the night. Initially, he seemed a bit timid on stage but as the crowd's applause grew with each song, Berman seemed to realize he could do \"this touring thing\". About halfway through the set, he said, \"I'm sorry it took me so long to get here. I had a few things I had to deal with before I could do this.\" Then later, he said that he knows he can do this now and plans on being back again next year. By the end of the show, he was a full-fledged rock star as he pulled his band back onto stage for a surprising second encore. Guitarist Peyton Pinkerton even seemed surprised as he shrugged his shoulders trying to figure out what was going on. People who feel intimidated on stage don't improvise or extend the lenghts of their shows. So, I took the second encore as a good sign for Berman.They finally finished around 12:15am with a cover of a T.G. Sheppard song. As much as I wanted to hear more and more songs, I knew I had a long drive home (pulled into the driveway at 3am) and felt confident that I would see Berman in concert again."
},
{
  "title": "Grey Eagle Tavern & Music Hall, 12th March 2006",
  "body": "== Setlist ==Slow Education\\Animal Shapes\\How to Rent a Room\\Buckingham Rabbit\\Inside the Golden Days of Missing You\\Random Rules\\Black and Brown Blues\\Smith and Jones Forever\\Pet Politics\\I'm Getting Back into Getting Back into You\\Horseleg Swastikas\\Sleeping is the Only Love\\The Poor, the Fair, and the GoodEncore:\\Trains Across the Sea\\Punks in the Beerlight"
},
{
  "title": "The Earl, 11th March 2006",
  "body": "== Setlist ==Black and Brown Blues\\Random Rules\\Smith and Jones Forever\\I'm Getting Back Into Getting Back Into You\\Trains Across the Sea\\Inside the Golden Days of Missing You\\Dallas\\Horseleg Swastikas\\How Can I Love You If You Won't Lie Down\\New Orleans\\Sleeping is the Only Love\\Slow Education\\Punks in the Beerlight\\The Poor, the Fair and the Good\\How to Rent a Room\\Buckingham RabbitEncore:\\Sometimes a Pony Gets Depressed"
},
{
  "title": "Fonda Theatre, Los Angeles, 12th Sept 2006 ",
  "body": "01-Trains_Across_the_Sea02-Getting_Back_Into_You03-New_Orleans04-Dallas05-Smith_and_Jones06-Horseleg_Swastikas07-Random_Rules08-Animal_Shapes09-How_Can_I_Love_You10-Time_Will_Break11-Slow_Education12-Pretty_Eyes13-Sometimes_a_Pony14-How_to_Rent_a_Room15-The_Poor_the_Fair_the_Good16-There_is_a_Placeaudio from this show available [http://netzoo.net/silver-jews-in-la-sept-12-2006/ here]"
},
{
  "title": "Double Door, Chicago, IL, 14 April 2006",
  "body": "Trains Across the Sea\\How to Rent a Room\\Random Rules\\Slow Education\\Dallas\\How Can I Love You if You Won't Lie Down\\Getting Back Into You\\Time Will Break the World\\Smith and Jones\\Inside the Golden Days of Missing You\\Horseleg Swastikas\\Animal Shapes\\There Is a Place\\Punks in the Beerlight\\----\\Somtimes a Pony Gets Depressed\\I Loved Them Everyone (T.G. Sheppard cover)\\Black and Brown BluesThe show was very, very good. David seemed bouyant and focused--I didn't notice any of the fumbling or wandering that earlier reviews had noted; he also has apparently memorized his lyrics, as he hardly used his notebook. The band was tight. The only disappointment was the absence of Bobby N. "
},
{
  "title": "The 40 Watt, Athens, GA, 10th March 2006",
  "body": "This was the first show of Silver Jews' first tour. Spiritual Family Reunion opened the show.== Setlist ==Random Rules\\Smith and Jones Forever\\I'm Getting Back Into Getting Back Into You\\Sometimes a Pony Gets Depressed\\Trains Across the Sea\\New Orleans\\How Can I Love You (If You Won't Lie Down)\\Inside the Golden Days of Missing You\\Dallas\\Horseleg Swastikas\\Sleeping is the Only Love\\Slow Education\\Punks in the Beerlight\\I Loved Them Every One ''(TG Sheppard cover)''Encore:Buckingham Rabbit== Review ==From http://cableandtweed.blogspot.comAs I've mentioned here a few times lately, last night I attended the first official show of the Silver Jews' inaugural tour (there was a surprise rehearsal gig in Nashville last week as well). It was a sold-out appearance at the 40 Watt in Athens. Rarely have I attended a show in which the crowd was so filled with anticipation and electricity. Everyone in line outside was excited by the significance of the evening, and many indicated that they had traveled long distances (from California and Virginia, not Atlanta) to be there.The band took the stage at midnight and played a 15-song set about 68 minutes in duration. The entire evening had the feel of attending a revival. A selection of tracks from throughout their history was played, as was a cover of TG Sheppard's \"I Loved Them Every One.\" It was obvious that the band was still feeling its way through some of the songs, and Berman did flub some lyrics. Berman had a music stand with lyric sheets on stage to help him through the set, and indicated that he has long had trouble remembering the lyrics to even his own tunes. Despite the fact they weren't polished, it was a hell of a treat getting to see the band play live after all this time. Bob (Nastanovich, ex-Pavement) sat in on a few songs, and is serving as the band's road manager for the tour. I really enjoyed the show, and it'll be interesting to see how the band improves over time as they tour and get accustomed to playing live."
},
{
  "title": "Double Door, Chicago, IL, 14 April 2006/Fri Apr 14",
  "body": "Trains Across the SeaHow to Rent a RoomRandom RulesSlow EducationDallasGetting Back Into Getting Back Into YouTime Will Break the WorldSmith and JonesInside the Golden Days of Missing YouHorseleg SwastikasAnimal ShapesThere Is a PlacePunks in the Beerlight-----Somtimes a Pony Gets DepressedT.G. Shepherd coverBlack and Brown Blues"
},
{
  "title": "Ottobar, Baltimore MD, 22nd March 2006",
  "body": "From: http://soidisantra.typepad.com/soi_disantra/2006/03/rock_to_baltimo.html== Setlist ==Slow Education\\Animal Shapes\\Black and Brown Blues\\Inside the Golden Days of Missing You\\Smith and Jones Forever [http://www.youtube.com/watch?v=c109u8Sagbs video]\\O Captain! My Captain! [http://youtube.com/watch?v=ZS2ZzWbciAs video]\\Trains Across the Sea [http://www.youtube.com/watch?v=CYLgB2cGaA8 video]\\How Can I Love You (If You Won't Lie Down)\\Dallas\\I'm Getting Back Into Getting Back Into You\\Pet Politics\\There Is a Place\\Horseleg Swastikas\\How to Rent a Room\\The Poor, the Fair and the Good\\Punks in the BeerlightEncore:\\Random Rules\\Sometimes a Pony Gets Depressed== Rock to Baltimore: Silver Jews at the Ottobar ==OK, so here’s the thing. Joos Cruise 2K6 was a whole lot of fun through the first four shows. Each one was a great time. I actually had fun with old friends and new friends. It was a special feeling to be there with DCB and Co. as they got their sea legs on this first tour. The performances were a lot stronger than I thought they would be, honestly. Some individual clunkers here and there, but with the help of an ace backing band DCB seemed to be doing fine. If there was any sloppiness it was always an endearing quality. Each night found everyone getting more comfortable on stage, especially DCB. There were some performances of “Punks in the Beerlight,” “Dallas” and “Smith and Jones Forever” that were classic. But I’d be lying to you – and myself – if I said these were truly awe-inspiring shows. Now that’s sort of the point. The Silver Jews don’t need to put on awe-inspiring shows. I’m not going to see them to see this well-oiled rock machine run through the hits. It was more of a familial experience, being there with this guy who has written some of the greatest songs in recent memory, sharing them with his most devoted fans in a live setting for the first time as he puts his life back together. It’s pretty fucking uplifting, y’know? Those first four shows were some of the most memorable and most fun shows I’ve ever been to, sure. But some of the best – totally objectively? Not quite. But hey, I’d like to see any band in the world have one of their first 10 shows ever be an all-time great.That all changed in Baltimore. First off…Should I live to be 75 or 80 years old, I will remember this show as one of the best I’ve ever experienced. Everything you could possibly want in a Silver Jews show was here. A great, tiny venue packed to the walls with Joos fans. The band members – and especially DCB – were in a great mood from the second they walked on stage and were feeling it from the start. If I remember correctly, as the earlier shows DCB was always last to take the stage but tonight he was the first one out, waving to everyone, wearing a huge grin. The small stage meant they were closer together, adding to the more unified feel.From the start you could tell this was going to be a good one. “Slow Education” was brilliant – Peyton Pinkerton broke out a slide and it really added a new dimension. He hasn’t been using that at previous shows, has he? This was the first time, right? Anyway, it sounded awesome. Speaking of sound, what a brilliant job behind the soundboard by the unbeatable duo of Steve West and Adam Cooke. My kudos to the both of them.“Black and Brown Blues” was a rollicking good time. Apparently DCB just doesn’t like that last verse (“When I go downtown I always wear a corduroy suit”) because he simply doesn’t sing it anymore. He just talks over it, which is highly entertaining. “Smith and Jones” was a highlight as usual. It’s always nice to see everyone bounce up and down during the chorus. I made sure after the show to tell Brian Kozur how much he single-handedly made that song one of the highlights of the tour. Just that extra added dynamic. And that’s what this tour was about – those added dynamics. Besides Tanglewood, this was a Natural Bridge-heavy tour, which makes sense since Peyton played guitar on that one. And my main issue with that record has never been the quality of the material, but just the general flatness of the production. You know that. And that definitely isn’t the case on the tour. The songs really come alive, sort of like that Frampton dude, but with less talkbox. A lot less talkbox.I was thrilled to get to hear “O Captain” again. I remember when I went to see a boatload of Pavement shows back in ’99, by the end of the tour the one song I was really hoping to hear on the last night was their cover of “Sinister Purpose” and they came through with it. I actually think the version of “Captain” from New York was a bit stronger, but this was still damn good. Just a pretty straightforward rock number, which was sort of refreshing. The Nastanovich double shot of “Trains” and “How Can I Love You” sounded really great. Like I’ve said plenty of times before, DCB’s voice works really well in tandem with another voice and “How Can I Love You” does that really well.“Dallas” was back to its majestic heights as Cassie came back in for the “cruising down Commerce” bits. I’ll take some credit for that one, as after the Philly show I told her I really missed her presence on it. “Pet Politics” is another song in which DCB obviously has issues with a verse (just like “Black and Brown”) that he just doesn’t like anymore. In this case it’s the “Adam was not the first man” one and in Philly he ad-libbed something but tonight it was a blank verse, DCB just strumming silently, eyes closed, deep in … something.As I get further away from the show I’m forgetting some of the details, but he was certainly chatty all evening. He asked if Brian Billick was in the house and mentioned how Ray Lewis ruined his life in Nashville. There was some other stuff, it was funny. Although nothing as funny as when he came back from backstage after an especially noodly version of “The Poor, the Fair and the Good.” “I go to the bathroom and come back and you turn into the Dead!” It was nice to get some confirmation from the man himself that this was actually happening. Anyway, that’s such a damn great song and how can you not love the thick drawl that Cassie lays all over it? “Un-mey-yuh-nuh-feh-stid.” That transliteration didn’t really work. Just know that it’s very adorable the way she says “unmanifested.” “Punks in the Beerlight” brought down the house, as always.The encore was the perfect ending to my time with the Jews. DCB was extremely loose and in good spirits, even pantomiming some lyrics, playing with his ring finger at the appropriate time in “Random Rules.” He was also messing with the timing of the vocals but on his terms, if that makes any sense. Earlier on in the tour it seemed like he was honestly reading the words off the page and just trying to get them all out. He was in total control tonight. Then for the final song he did what I was hoping he’d do all tour – put down the guitar and just stood there at the mic and let loose on vocals. If there is a best song to do this on, he certainly picked it. Eyes closed, both hands gripping the mic, he gave a growling, inspired take, complete with MES’d endings, as indicated in the setlist above. He walked off the stage to thunderous applause, the band tore it up for another 20-30 seconds, stopped, Billy Idol came on over the speakers and that was it. What a way to go out. Can’t wait to do it all again next year.-DM"
},
{
  "title": "Starlight Ballroom, Philadelphia PA, 21st March 2006",
  "body": "From: http://soidisantra.typepad.com/soi_disantra/2006/03/sd_on_the_road_.html== Setlist ==Inside the Golden Days of Missing You\\Animal Shapes\\Smith and Jones Forever\\Pet Politics\\I’m Getting Back Into Getting Back Into You\\Random Rules\\New Orleans\\Horseleg Swastikas\\Dallas\\Trains Across the Sea\\The Poor, the Fair and the Good\\Black and Brown Blues\\Slow Education\\How Can I Love You (If You Won’t Lie Down)\\Punks in the BeerlightEncore:\\There Is a Place\\Sometimes a Pony Gets Depressed== SD On the Road: Silver Jews in Philadelphia ==Didn’t get to finish my thoughts on the Philly show before heading up to Baltimore last night for the finale of Joos Cruise 2K6. What a whirlwind week. Here’s a quick report on last night’s show in Philadelphia. Oh, and if you’re looking for 24 rankings, those will be along on Friday or so. I’m in Silver Jews mode now. Not even Jack Bauer can pull me out of that. I mean, I sit down Monday night to watch and I’m still in that afterglow of those first three Joos shows and then the first thing I see is dead Tony Almeida and man, that’s just a buzzkill. 24 takes a backseat. If I were to power rank things that take top priority, there’s just not much that would beat Inaugural Silver Jews Tour. Maybe Wizards in the NBA finals or the Pirates in the World Series. But those are about as likely as … well, a few years ago I would have said a Silver Jews tour, so, you never know.We almost didn’t make this show thanks to the double whammy of an accident on Canal Road and downed power lines on MacArthur Boulevard. But things cleared up well enough and we ended up getting there while the openers were still on, even though it took us a good 5-10 minutes to realize they were actually playing. The Starlight Ballroom kind of sucks ass. It made me appreciate the sterile straightforwardness of Webster Hall. It’s just sort of a haphazard operation, which I guess was sort of endearing – no handstamps, they give you your own drink wristband, etc. But horribly disorganized bar service, you can’t take drinks to the main area (apparently a city-wide rule, but one nobody was following), etc. It’s also rather large – it seemed like an old roller rink or disco or something. So while there were tons of people, it was still pretty spread out. We ran into some fine folks before the show – DP, AA and the Good Guise. So that was fun.As with most of the shows, it started off a bit shaky. This isn’t an insult, it’s just how it is. Again, I think a lot of this had to do with the venue. At the three previous shows, people were pretty packed in. Yes, there were some pockets of emptiness further back, but this sprawling room had people watching from all over. Just made it feel a little less intimate, to use a stupid word. Cassie seemed far less enthused from the outset, which I feel had to do with the crowd. She feeds off the energy – at two of the first three shows she mentioned how nice it was to see people dancing and moving around, and there was barely a head nod at this one. And she was certainly in more casual attire, too, so maybe she was just taking it easy for the night. My hunch was sort of confirmed when she didn’t sing on “Dallas” for the first time in four shows. I missed her, to be sure. That’s like my favorite part of the set, when she takes over on those parts. DCB’s got a great voice, but I think it works even better in contrast to another voice, especially a pretty, girly one, like Cassie or Malkmus.Anyway, while the dead crowd might have made Cassie a bit reserved, it almost had the opposite effect on DCB. Here’s a half-baked theory (only kind I know) I’ll throw out there. DCB’s actually more comfortable with the dead, stoic crowds. Maybe I’m just basing this on my own experiences. The very few times we’ve played shows where there have been people in the audience hopping around and actually looking like they are enjoying themselves, it’s freaked me out. I’m like, “Why are those people doing that?” And it makes me even more likely to stand perfectly still and not make any eye contact with anyone. But the other 95% of the time, when people are just standing there staring at us blankly, now that I’m used to. That makes me feel comfortable. So maybe DCB’s the same way. Or, more likely, he’s just getting exponentially more comfortable up on stage as he plays more shows.First highlight of the night was “I’m Getting Back,” which showed DCB’s newfound comfort up there on stage. It seemed at the first few shows he was more worried with simply getting all of the words out as opposed to actually putting some feeling into those words. But on this one he was definitely getting into it more, focusing just as much on the how he was saying it as opposed to the what. This run through of “New Orleans” was tons better than the disastrous attempt at Charlottesville but there was still something a bit lacking. I think with this band setup, those songs from Starlite just don’t work as well. Actually, that’s a bit presumptive of me to say since they are playing a grand total of two songs from that album and one of them sounds just fine. But my point is, “New Orleans” is sort of a shambly indie rock song, and this is not really a shambly indie rock band.Putting “Trains” and “Poor/Fair/Good” back to back worked really well and this is when things started to pick up. Not pick up in the sense of rocking out, since those are obviously the two most hippie-fied numbers of the set, but man does it ever work. MZ shot me an eyeroll (shocking, I know) for my gentle swaying during these songs, but I just couldn’t help it. “Black and Brown Blues” was going along wonderfully until DCB decided to ditch the last verse. It was still quite good and it was pretty funny to hear him just talk over that last verse. Ending with “Punks” – as opposed to encoring with it like the previous shows – was a good call. That song is just impossible to mess up, we got a great fist pump at “Toulouse Latrec!” and it worked the crowd into at least a mini-frenzy. Encore was some pretty hot shit. Bobby N. let loose during “There Is a Place” and “Pony” was fantastic.So yeah, from “Trains” on, this show was as good as anything from the first three nights, but overall it was probably the weakest of the bunch so far. Not that I would ever do something like rank the quality of the shows. That would be totally out of character. But this is part of the fun of going to a whole bunch of shows. Even seeing the band on what could be referred to as somewhat of an “off” night, I had a blast, and it was fun to see them continue to work out the kinks and get more comfortable on stage. Here’s a review from some Philly paper, and I think the last line captures it well. ‘David Berman sure had fun.” That makes it worthwhile on its own, right? I also bought one of them fancy $20 trucker hats after the show. I couldn’t resist. OK, Baltimore report will hopefully be up later this afternoon/evening. I don’t want to give away spoilers but … hot damn. Hot. Fucking. Damn.-DM"
}
]