[
{
  "title": "Reviews",
  "body": "== Bright Flight/ \"Tennessee\" EP ==By Jillian Steinberger, [http://www.neumu.net/ neumu]In over a decade, the Silver Jews (AKA David Berman and whoever he chooses to record with) have never quite fit into the musical landscape, existing in a genre twilight zone, subverting the codes. Berman makes his own rules and doesn't always follow them. His roots are in the music of American youth when he was coming up in the '80s - punk. He records for Drag City, an indie label. On both his latest album and his EP, Berman identifies most closely as a countrified artist - although his music is beyond country and alt.country and tacitly offers a criticism of both. Berman's often compared to rock heavyweights. Bob Dylan, for example, although they don't share much beyond common ancestry and a voice with a bit of scratch. Lou Reed? That might be valid, since the band has an early seven-inch called \"The Silver Jews and Nico\" (1993) - but it's not. While they've been compared to Neil Young, The Jews are not like Neil Young - they are wry, post-modern. As for Tom Waits, Berman's voice is hardly the same gravelly bear, and the songs differ vastly in tone and texture. And although the Silver Jews have been seen as a Pavement side project (members of that now-defunct über-indie supergroup play on previous albums, but not this one), it isn't. The Jews are so often misunderstood. There's a boho masculinity about the Silver Jews' music. Lore has it the \"band\" (originally called Ectoslavia) began as a trio of University of Virginia, Charlottesville, graduate students (Berman, plus ex-Pavement members Stephen Malkmus and Bob Nastanovich) sitting among beer cans and cigarette butts, inventing lo-fi tunes for friends. Eventually they moved to New York and left the little songs on people's answering machines (including Sonic Youth's, whose number they reputedly finagled from a girl at a record store). While his sometime bandmates dabbled with stardom, the apparently incorruptible Berman has stuck to his indie roots. He refuses to tour, saying he's not a performer, and live performances offer no value above and beyond the recorded songs. Yet he does make appearances, drawing caricatures at record stores, most recently in New York (Kim's on St. Mark's Place) and London (Rough Trade, for one quid). Very common-sense in Berman's world. An MFA in Creative Writing and published poet, Berman emphasizes the lyric, with no shortage of attention to songwriting or musicianship. He is the author of \"Actual Air\" (Open City, 2000) and numerous pieces in that beloved Situationist rag, The Baffler. Richard Brautigan, psychedelic beat author of deep teen fave \"In Watermelon Sugar,\" comes up regularly as a comparative reference. At Berman's request - and to their purported disappointment - Malkmus and Nastanovich have taken a break from the latest project, although word is they'll return for future recordings. To protect the Silver Jews from the continued perception of Pavement-side-project status (the opposite could be argued), Berman opted for experienced studio musicians. Props to them; they play beautifully together and with Berman. William Tyler plays acoustic and electric guitar, while Lambchop member Paul Niehaus, who has sessioned with Yo La Tengo, adds slide and twang with wave table and pedal steel guitar. Keyboards go to Tony Crow (Lambchop). Michael Fellows (Royal Trux, Rites of Spring) returns with his bass from the Jews' 1998 release, \"American Water,\" with drummer Tim Barnes. Cassie Marrett adds a welcome female dimension, and Berman has found his vocal female doppelgänger in her sweet, textured, country-punk voice. Closer listenings, particularly to the LP, reveal how grounded it is in its sense of place and history. Overall, the new work seems to be about movement and making tough choices - having the courage to live life according to one's vision and determining one's destiny. It is about what happens if you don't. It is about yearning - to be a better person, for communion with another, for a better world. It is about when the masculine joins the feminine and the worthwhile challenges of negotiating long-term romantic partnerships. It is packed with images - screen doors banging in the wind, freight trains rolling West, God when he was young, plug-in reindeer, floating hatchets and rhinestone suits. It is about the South - a condemnation of hypocrisy, rednecks, horseracing, guns and throwing in the towel too early. And it recalls and questions the meaning of American history. The songs are by turns tender, sweet, sexy, wry, tragic and mournful. Some are romantic (\"Tennessee,\" \"Room Games and Diamond Rain\"), while others are spiritual (\"Slow Education\", \"Death of an Heir of Sorrows\"). \"Slow Education\" opens Bright Flight; the album's first lyrics soothe the weary adult soul (\"When God was young, he made the wind and the sun/ And since then, it's been a slow education\"). \"Everybody's going down on themselves\" in this NC-17 lullaby, featuring Berman's none-too-scratchy vocals and Marrett adding a pretty backup. I like the rhythm, the keyboards are right on, the guitars dish out the perfect twang, and even George Washington makes an appearance. \"Room Games and Diamond Rain\" follows. Again, the rhythm's on the mark and that same pretty twang from \"Slow Education\" weaves in. The song's about settling into romantic commitment; the affecting melody and rhyming lyrics might get schmaltzy (\"You keep finding and reminding me/ That you only can be kind to me\"), but the chorus takes it in other direction, presenting a kaleidoscope of compelling images (\"It's a fox hunt, it's an f-stop/It's a ten-acre wood\") that balance the song out. Sweet but contemplative, \"Room Games\" is one of my favorite songs on Bright Flight. I like how it sounds, what Berman talks about and the way he expresses himself - it's tender, but not saccharine. Some of Berman's songs have an onomatopoetic quality. Many songs in the history of country have sounded like trains (Johnny Cash's \"Folsom Prison Blues\" is a good example). On Bright Flight I do believe I've heard my first horse-galloping song, the instrumental \"Transylvania Blues\" - horse-galloping music from a fourth-generation, Southern Fried, American Jewish perspective. (Overall, the instrumentals are respites from the intense lyricism of the songs.) The 4-song EP, \"Tennessee,\" was a teaser released two weeks before the 10-song Bright Flight. I figure Berman didn't include the other tracks on the album because they didn't fit Bright Flight's narrative thrust. On both the EP and LP, \"Tennessee\" is the centerpiece, the heart, of the new work. Berman conveys his agenda with two unsubtle lines, \"Punk rock died when the first kid said/ 'Punk's not dead, punk's not dead.' \" (A friend argues that it died when Joe Strummer got his teeth fixed.) With this shout-out, D.C. says he's not working in a vacuum. He's drawing from tradition (punk), but he's not stuck in it. Berman appeals to youth as if to say, \"Think for yourself. Invent new forms; don't trot out the old tired forms.\" It's an important message, and typical Berman. In \"Tennessee\" the narrator hits the road with his gal pal and flees to Nashville. Acoustic guitar lends a folky feel, while electric guitars provide a twangy lead and an airy Western texture. Marrett's voice and delivery are perfect on this duet. The line, \"Louisville is death\" has caused speculation that Berman uses \"Tennessee\" to reveal a distaste for this significant village in the world of indie, one that developed while living with his girlfriend while she finished school. Louisville's indie stars include Berman's Drag City label mates, Will Oldham (Bonnie Prince Billy, Palace) and David Pajo (Papa M/Aerial M, Slint, Tortoise), neither of whom play often in their hometown. Bob Nastanovich has claimed that Louisville is only good for compulsive gamblers, and that the punk and indie scenes have died. The image of \"Horseleg Swastikas\" and lyrics like \"My horse's legs look like four brown shotguns\" (\"Time Will Break the World\") evoke a town populated by fascists perverting nature at the racetracks. Hence, the male voice's desire in \"Tennessee\" to make for Nashville, where he can juggle with the rubble of Southern music and build something new. On the EP, \"I'm Gonna Love the Hell Out of You\" is a sexy number heavy on guitar, tambourine and Berman telling a story about a \"Christian rock ingénu\" who wants to \"love the hell out of you.\" Where are those Nancy Sinatra boots when you need 'em? This song makes you want to stomp around on the table tops. If you don't know how that feels, listen and you'll know. The most fun of Berman's new crop, it works on the EP but would have disrupted the flow of the somber, introspective LP. A demo was originally released as a Jane Magazine CD. Berman originally drew me in with a deja vu line that captured a previously unarticulated concept: \"We're trapped inside the song,\" he and Malkmus wailed in \"New Orleans\" on 1994's Starlite Walker. Now I'm trapped inside Berman's latest project. And I love this rebel Jew. [Note: Bright Light gets an \"8\" rating; the \"Tennessee\" EP gets a \"6\" rating.]"
},
{
  "title": "Lookout Mountain, Lookout Sea Reviews",
  "body": "== Stereo Sanctity ==From http://stereosanctity.blogspot.com/2009_01_01_archive.htmlThis year, I found myself devouring, internalising and generally clinging on to the Silver Jews back catalogue, much like a post-apocalyptic caveman who’s just discovered the bible. So it was with perfect timing that David Berman released one of his band’s strongest, and certainly their brightest, collections of songs to date, right on schedule to catch me at the height of my devotions. In a brief Q&A with Plan B magazine back in May, Berman said: “Touring gave me a good look at who I’d be speaking to when I wrote again. In the past I only had a blurry face to go on. What I saw was a lot of tender-hearted young people with little in the way of wisdom gained from harsh experience, leaving them vulnerable to the saturation and aftermath”. And indeed, his newfound confidence as a mentor to his listeners is obvious throughout ‘Lookout Mountain Lookout Sea’, as he steps boldly forward from the emotionally shaky foundations of 2005’s ‘comeback’ record ‘Tanglewood Numbers’, combining the gutter-bound wit of old with the infectious wisdom and musical perfectionism of a man born again, ready to share some lessons learned.As with most truly great albums, this isn’t some epic attempt to paint a sprawling musical picture of the whole of life or something; it’s just thirty five minutes comprising ten carefully selected songs from the pile the band happened to have lying around, no more no less. Ten songs that, without wishing to overlook the band’s oft wondrous arrangements, any bum can recreate with a cracked voice and a handful of fingers; in fact a chord sheet and tabs are helpfully provided in the LP for that very purpose. But nonetheless, ten songs so densely packed with wit, wisdom, and crab-walking suburban profundity that their resonance will (I would like to think) echo long through the minds and hearts of the kind of people who listen to the words in songs and like to seek more songs with better words, long after Drag City has gone kaput in the face of the forthcoming dark age and the ‘Jews have retired to their poverty-stricken critical laurels.I know I’ve used the words ‘wit’ and ‘wisdom’ twice in scarcely the space of a paragraph, but fuck it, wit and wisdom are what Silver Jews in 2008 are all about. Like every genius out there, Berman recognises that the funniest things and most serious things in life are one and the same, and, above all else, ‘Lookout Mountain..’ is uproariously entertaining. “San Francisco B.C.” has gotta be the most inspired long-form narrative song since the Velvets’ “The Gift” or Dylan’s “..115th Dream”, highlighting the most graceful wrangling of a rhyming dictionary I’ve ever encountered, whilst “Aloysius, Bluegrass Drummer” and “Partybarge”, initially sounding like goofy, confounding joke-songs, reveal delightfully skewed depths on repeat spins. “Suffering Jukebox” could launch a rousing singalong in any hypothetical honkytonk of the soul, its central conceit still flat-out killer after hundreds of listens, whilst closer “We Could Be Looking For The Same Thing” would raise bittersweet tears from the same audience of imagined mountain men moments later – simply a straight-up, beautiful and wholly honest love song – no gimmicks, no jive, no spikes.‘Lookout Mountain, Lookout Sea’ is one of those records, like Leonard Cohen or Richard Thompson used to make, like Jonathan Richman still does make, that is hugely enjoyable, but that teaches listeners something important at the same time, asking nothing in return. Edutainment for the soul. Quite what it’s teaching you exactly, I wouldn’t care to elaborate, that’s up to you to figure out, but let’s just say that if previous Silver Jews records were near-biblical masterpieces of self-pity, this one starts from the same square, but approaches the game with a hell of a lot more get up and go.(Oh, and best cover art of the DECADE also, I think.)“Somewhere in a foggy atlas\\Lookout mountain, lookout sea\\First life takes time, then time takes life\\Now the next move’s up to me”Roll on 2009.== BBC ==by Tim Nelson, 06 June 2008The Silver Jews' sixth album cover - wherein three stuffed Babar toys climb onto a rocky outcrop - mysteriously and trickily relates to the record's tales of virtue gone to seed. But in 2008 what are the odds of ever seeing it? Since the likelihood is that most will simply download the best tracks for their mobiles, it's best to forgo theoretical discussion about the gap between speech and song, in favour of an appreciation of the album's country-rock attack, ethereal choruses and mosaic burr. Yes David Berman (along with wife Cassie) is back with yet another line-up in his journey along a road that's long since ceased to be incorrectly termed 'Pavement offshoot'.Actually, Look Out Mountain, Look Out Sea is too varied an album to be called country, or rock, let alone country-rock. On the opener What Is Not But Could Be If, head songwriter Berman comes across like a latter-day psychedelicized Johnny Cash, throwing thoughts like tomahawks and quoting Yiddish wisdom. This urgent, apocalyptic mood continues on the shimmering alt-pop slabs of Suffering Jukebox and My Pillow Is A Threshold. But the album's brilliance lies in its mix of approaches. There are the disturbing and arresting visions of Strange Victory, Strange Defeat and San Francisco B.C. (a distant relation of Dylan's 115th Dream); the marimba delirium of Candy Jail and the ship's horn and seagulls blasting on Party Barge. In addition, the naive chiming rendition of Japanese composer Maher Shalal Hash Baz’s Open Field offer a perspective upon Berman’s last-chance Texaco of lowlife insanity and romantic longing.The man's final triumph here lies in his lyrical vision, which goes beyond merely skewering a world of craven mediocrity to suggest better possibilities, where the end might just be another beginning. But rather than expound further on the Silver Jews' new sympathy for unloved machine humanity, perhaps it's enough to say that this is the best album to come out of Tennessee this year; indeed possibly the world. It even has a chord chart. So you really should get your own copy.== Pitchfork ==Rating: 6.7\"In 1984, I was hospitalized for approaching perfection.\" As first lines of an album go, this one, the opening shot fired on Silver Jews' 1998 album American Water, is among the greats, up there with Raw Power's \"I'm a street-walking cheetah with a heart full of napalm\" and Straight Outta Compton's \"You are now about to witness the strength of street knowledge.\" It's an especially great line coming from Silver Jews' David Berman because \"perfection\" as a concept has little place in his universe. In this landscape, flubbed notes exist alongside amazing guitar solos (when Berman's buddy Stephen Malkmus is around, anyway), shirts are untucked, keys are more suggestions than rules, some of the best lyrics in rock history are interspersed with unapologetic groaners (I could kiss the guy who wrote, \"Come to Tennessee/ 'Cause you're the only ten I see\") and characters are often flawed to the point of paralysis.Perfection being what it is for Silver Jews, and Berman being so comfortable with that notion, it's easy for fans to gloss over the rough patches. I have a feeling I'm not alone when I say that on every SJ record - save American Water, almost - I still skip around a bit. The nature of Silver Jews allows for inconsistent albums, even though the records appear infrequently. Two or three or four duff tracks on one record is nothing to get worked up about, and they may even add to the ramshackle charm. And so while Lookout Mountain, Lookout Sea, the first Silver Jews album in almost three years, has the usual small handful of eh-to-just-OK tracks, it also feels different from prior Silver Jews albums in a way that's hard to put a finger on.Part of it could be the lack of knockout songs. There are no instant entries to the SJ canon, nothing here that knocks you on your ass, not a single \"How did he write that?\" moment. And this problem is there from the beginning, the opening, where SJ have always killed: Where Tanglewood Numbers grabbed us by the throat with \"Punks in the Beerlight\" and The Natural Bridge turned a chair around and sat us down to explain \"How to Rent a Room\", Lookout Mountain opens with the plodding and dull \"What Is Not But Could Be If\". You feel like you just tripped and fell awkwardly into the album.It doesn't help that the production is oddly harsh and distant-sounding; where Berman sounds best clear and uncluttered, so that it seems like he's engaging you in conversation, on this record his voice has a weirdly persistent metallic reverb clinging to it, like he's broadcasting from inside a tin can and you're straining to connect with him. Something about the sound makes him sound a bit uneasy, stiff, and a touch less confident. Busy Nashville producer Mark Nevers handled a chunk of the recording and all the mixing, and the warmth he's been known to give albums by Lambchop, Bonnie \"Prince\" Billy, and the Clientele is missing here. Berman's bassist and vocalist wife Cassie is, as she was on Tanglewood Numbers, far too high in the mix. There were some weird choices made in the studio.I shouldn't dwell on the production, since this band started out as the lo-ist of the lo-fi, recording white noise-packed songs on answering machines- and besides, you listen to Silver Jews for words. But an album that finds Berman in a more focused mode lyrically, writing lines that seem to straighten out some of his bent lyrical aesthetic, would do well to come with a more welcoming sound. In any event, there are still good songs with quotable lines here, thankfully, and the tunes throughout are solid. The lengthy, bouncy, Dylan-y \"San Francisco B.C.\", in particular, is packed with lyrical nuggets: \"We had sarcastic hair/ We used lude (sic) pseudonyms/ We got a lot of stares on the street back then\" and \"She said, 'You don't make enough to provide for me'/ I said, 'What about the stuff that we- quote- believe?'\" are two. (I love how you can picture the fingers in the air setting aside the word \"believe.\")If the focus throughout seems to move away from stringing together rich, penetrating images, Berman is still skilled enough with words to make him do what he wants them to. The peppy, rushed \"Aloysius, Bluegrass Drummer\" is a surreal short story, with a title character who is a dishwasher at a restaurant \"Open 'til the end of time\" and who falls for a girl \"all strung-out on hard street fat.\" And then the weary countrified lament \"Strange Victory, Strange Defeat\"- which wonders about the \"handsome grandsons in these rockband magazines\" who have supplanted \"the fat ones, the bald and the goateed\"- works pretty well, even if the second half of the song doesn't stick. The closing track, \"We Could Be Looking for the Same Thing\"- a cozy ballad that finds David duetting with Cassie- strips the lyrical flourishes back almost completely: Lines like \"Where the days turn the weeks into months of the year\" and \"I've been around some and I've seen enough to know/ We could spend happy lives, inside the days of you and me\" could have been written by any number of singer-songwriters. That seems purposeful: Berman seems to have something specific that he wants to get across, and he's OK saying it in what, for him, is a direct way.With both Lookout Mountain and Tanglewood Numbers, there's been discussion about these records being made after Berman's time staring into the abyss, when he survived a suicide attempt, worked through a serious drug problem, got married, started touring, and generally got his shit together. So it's tempting to hear some of the differences with this record - the tamer imagery, the more even keel, the highs that aren't so high - as somehow mirroring the changes in Berman's personal life. For me, though - since I never knew how tough Berman had it while enjoying his records up through Bright Flight, never had a clue as to depths of his suffering, and never heard his music in that context - it seems wrong to start thinking about such things now. Instead, I prefer to think of Lookout Mountain as an album of pretty-good songs from a guy who has written some unbelievably great ones, and will, more than likely, write some more of that quality down the road. There's never been any kind of definable arc with the Silver Jews, no movement toward a fixed point; it's more about keepin' on keepin' on. Once perfection is off the table, and you're just doing the best you can with what you have, there will be moments like this.== Drowned in Sound ==Rehab is a bitch. On the disjointed Tanglewood Numbers there’s an intimate understanding of an addict’s despair (“Let’s not kid ourselves, it gets really really bad”), an album which sags under the weight of facing a brave new world for the first time. Three years later, a presumably healthy David Berman has entered the honeymoon stage of sobriety, looks back on his drug and alcohol addiction through rose-tinted spectacles (‘Candy Jail’), and steps forward even if his legs are a bit wobbly yet.‘Suffering Jukebox’ _acts as the most obvious metaphor for Berman’s well-documented personal tribulations. His matt-finish baritone croons, “While these seconds turn these minutes into hours of the day”, and with that comes the acceptance of a man who may not have completely put to rest the demons of his _“chemical dependencies”, but he’s getting there. He’s resigned himself to the tendencies of those who’ve given up their bad habits to innocently contemplate the world’s adulation, or foolishly anticipate society to follow their inspired lead (_“people in this town don’t want to know”). _ ‘Party Barge’ _doesn’t allow Berman to trip into this malaise without a sense of humour. Wife Cassie chimes-in for the _“Send us your coordinates / I’ll send a Saint Bernard” _punch-line, a saving grace device which has probably kept the poor man from going over the edge. Nobody mixes mockery and mayhem in quite the same way.Silver Jews’ latest collection of songs is more fully fleshed out than at any time in D.C. Berman’s storied past. This unexpected attention for detail has its trade-offs: ‘94’s Starlite Walker _may very well have been the best jam session of half-formed ideas ever put to tape. In those days, conventional wisdom was the Joos were little more than an outlet for the Pavement boys and their agoraphobic college buddy to mess around in the basement. Today, there’s a good many people who’d reverse the emphasis. _Lookout Mountain, Lookout Sea swings the pendulum away from the Stephen Malkmus-infused indie rock of Tanglewood Numbers _back to the alt-country favoured flair of ‘98’s American Water_ and Bright Flight of three years later.If it’s not quite right to say this is a return to form after one less-than-stellar effort, _Lookout Mountain, Lookout Sea _is a lot more fun for hearing Berman returning to his comfort zone. The pure dynamics of a countrified Silver Jews serves to put the spotlight on the lyrics, which isn’t a bad thing. His old friend, Stephen Malkmus, doesn’t appear here and if the music suffers from being sporadically uninspiring, it’s a distraction only until Berman delivers his next great line. Cassie Berman more than ably takes SM’s place for the oddball harmonies and bass guitar duties. Although she has popped up on SJ records before, the impression is Mr Berman has been grooming the missus for this moment, apparently coming to grips with her shortcomings as a musician. Frankly, I don’t know what Berman was worried about, as she always sounded pretty great to me.The juxtaposition of malaise and jubilance which has been a hallmark of previous Silver Jews records is leavened here with wry commentary of his dysfunctional “family shadows”. If his sentiments oft precariously fall into the throwaway banalities category it’s Berman’s simple and heartfelt verse - “These doubles drive these dollars and the light of day away” - that makes all the difference.Somewhere in the ‘90s, Berman sequestered himself in Tennessee, and his themes radiated outward from this observatory. Here, the songs are standalone vignettes which step out from the comfortable confines of Nashville and face the rigors of contemporary American life with an uncharacteristic wide-eyed enthusiasm, an underlying concept of triumph beyond tragedy across the entire album.In much the same way the beauty of Mark Twain novels is the caustic wit which furrows beneath his Norman Rockwell stories, Berman’s scrutiny begs but doesn’t necessarily demand the listener to read between the lines. He is foremost a writer at heart, but unlike Twain the charm of his affable personality is that he really doesn’t give a shit. At its core, Silver Jews is a morality play told by a man who hasn’t been able to quite live up to common sense standards. Never mind being caught carrying “burglars’ tools”, he’s getting so close to redemption he can taste it. Lookout Mountain, Lookout Sea is the logical next chapter in this manuscript which has had many of us hooked since the opening lines.== Glam Racket ==“No I really don’t want to die/I only want to die in your eyes.”“How To Rent A Room” David Berman wrote those words a little more than a decade ago, and I was one of those that considered Berman’s most depressive period to be his best creatively. There was a certain amount of guilt with that, given the circumstances, as you never want someone to actually harm themselves just for the sake of your own record collection.Lookout Mountain, Lookout Sea is one of those “happy” David Berman albums, and one that I disliked the first time I heard it. But after seeing them live, I got a different perspective. The songs came off a lot less polished than on record and I could actually see Berman’s happiness. The interaction with other band members, the obvious love of his wife, and the energy that he fed off of from the audience.A live setting and the sterile confines of the studio are two polar opposite locales. And if Lookout Mountain suffers from anything, it is the sterility. The sense of playfulness is occasionally lost and there are times when the lighthearted nature of the recording overshadows any hint of Berman’s wordy humor.What a shame, as there are more than a few tracks that are slyly hilarious and one cut, “San Francisco B.C.,” which is one of the best songs Berman has ever written. In it, David creates a tale of criminal activity, infidelity, and mystery. It’s plot is as exciting as any screenplay and you’re glued to the proceedings like any good movie. Unfortunately, it’s not good enough to place Lookout Mountain, Lookout Sea alongside such greats as American Water or The Natural Bridge. It is, however, good enough for me to consider Berman’s bright side and not get sad when he’s feeling so good. == Aquarium Drunkard ==I had a friend introduce me to the Silver Jews in college. We shared a radio show together our freshman year and he would often pull out tracks from the American Water LP for the broadcast. But that was all I ever heard by them until 2006’s Tanglewood Numbers. With this limited exposure, and given the story of Berman’s bout with depression and time away from releasing output, Tanglewood seemed the perfect place to jump on. I’m glad I did. Not necessarily because of that album, though, but because of Lookout Mountain, Lookout Sea, its follow up, and its better.The tone of Lookout Mountain is immediately softer than its predecessor. Where “Punks in the Beerlight” had opened Tanglewood Numbers with a musically raucous but lyrically maudlin rocker, this album opens with “What Is Not But Could Be If,” a song that ruminates even as it sets the tone for moving forward across jangling guitars and hopeful insight. “My Pillow is the Threshold” is one of the albums darkest moments. “It’s a dark and snowy secret / and it has to do with heaven / and what looks like sleep / is really hot pursuit,” intones Berman in the first chorus. But the pause that this song gives is immediately offset by the fantastic “Strange Victory Strange Defeat,” one of the more sharp and lovely eviscerations of the music industry in some time.Admittedly my knowledge of the Jews’ back catalogue is lacking, but some of the more surprising moments on the album are the tracks that recall the loose, silly and rollicking version of Bob Dylan that were often strewn across his early records. “Aloyisius Bluegrass Drummer” is a ridiculous tale of a dishwasher and his love for a rather gluttonous musician from some imaginary place called “Region 10.” “San Francisco B.C.” is the type of endlessly-detailed story that recalls “Bob Dylan’s 115th Dream” - it winds out and back around itself with references to “sarcastic haircuts” and characters that insist that “love is the douche of the bourgeoisie.” “Party Barge” similarly creates its own mythos, while undermining it all the same. “Why not see a legend while it’s still being made,” Berman calls out amidst fog horns, seagulls and urges from Cassie Berman to “send us your coordinates / I’ll send a Saint Bernard.” These tracks pepper the record with a loose feel that makes the harder moments sink in more effectively and even get you to start examining the goofier numbers for meaning as well.Lookout Mountain, Lookout Sea is a the epitome of well crafted modern art - its search for truth and progress takes it through moments both high and low, serious and silly, and comes out all the better for it on the other side. - j. neas== LA Weekly ==By Randall RobertsPublished on June 11, 2008 at 12:41pmIn “San Francisco B.C.,” the centerpiece of the Silver Jews’ new Lookout Mountain, Lookout Sea, a protagonist and his girlfriend, whose first words upon their meeting were “romance is the douche of the bourgeoisie,” get involved in a misadventure. Over the next six minutes, lead Jew David Berman spins an oddball yarn with shocking depth and efficiency, each line crafted to serve both the story and the song. Like the great dramatic monologues and dialogues of the past half century (“Teddy Bear” by Red Sovine, Bob Dylan’s “Idiot Wind,” “Pancho and Lefty” by Townes Van Zandt and “Bridges and Balloons” by Joanna Newsom), the song creates a world and fills it with narrative. “San Francisco B.C.” features a ne’er-do-well narrator and his vegan girlfriend. Her dad’s a barber with portentous shakes, and they get tangled up in a murder with a man named Mr. Games, who has “jeweler’s hands and a blurry face.” Countless epic lines and verses follow. We learn about a burglary of “children’s fur coats and diamonds and jewels,” a brawl (or, as Berman calls it, “fist cuisine”) with Mr. Games’ stepson Gene, love and betrayal and curlicue twists and turns both plotwise and guitarwise, all carried along by the chug-chug-chug of a song that blends Charlie Daniels and Charlie Rich with a dollop of Charlie and the Chocolate Factory.Lookout Mountain, Lookout Sea is the sixth, and best, full-length release by Silver Jews, Berman’s two-decade-long project, which he’s gradually transformed from a Pavement-infused guitar band (Stephen Malkmus was an early member) to a crystal-clear country-rock concern, with twang and torch, piano flourishes, the occasional church organ and an ever-present drive. It was produced in Nashville, Berman’s home, by Mark Nevers, who himself has carved out a secret little corner of the country-music capital by overseeing beautiful albums by Lambchop, Bonnie “Prince” Billy and Calexico — as well as engineering everyone from Marie Osmond and Etta James to George Jones and Johnny Cash.And it’s Cash’s voice that Berman’s most closely resembles. Except Berman’s is flatter, and any extended rave on his lyrical expertise must contain this proverbial asterisk: His is a punctured tire of a voice, with a sad-sack style that suggests an insurance salesman with a stuffy nose more than it does the Man in Black. It’s droll and it’s rough, but it pushes, it moves, it travels where Berman wants it to, or nearly. It’s singing as necessity, and God bless him for putting it out there. The good thing is that Berman’s wife, Cassie Berman, is the perfect foil, and her harmonies on “Open Field” and “Suffering Jukebox” help balance the tones.Of course, the best way to appreciate the joys of Berman is to focus on the words, because he’s the best lyricist out there. His only book of poetry, Actual Air, remains a steady seller nearly a decade after its original publication, and Berman counts among his admirers both the former U.S. poet laureate Billy Collins and Pulitzer Prize winner James Tate. Like his verse, Berman’s songs draw on an odd assortment of fascinations: early American presidents; civil servants; bars and their oft-sad clientele; Minnie Pearl; and “squirrels imported from Connecticut just in time for fall” (Berman’s a little squirrel-obsessed, in fact). And, more and more, questions of faith, as in the album’s opener, “What Is Not but Could Be If,” in which he declares, in the resonant voice of a 19th-century senator: “The truth is not alive or dead/The truth is struggling to be said.”Berman’s songs tell stories so rich and dynamic that they make the extended narratives of Bob Dylan story-songs sound sloppy and unfocused (which, admit it, they often are). Take, for example, the first couplet of the joyous, left-field anthem “Party Barge”: “Father drove a steamroller/Momma was a crossing guard/She got rolled when he got steamed/and I got left in charge.”What does our narrator do with his freedom? “Living in this little town with my pedigree in shards/I chopped down a weeping-willow tree and built this party barge.”(Of course.) What follows is a celebratory rock song replete with the sound of towboat horns, squeaking seagulls, driving guitar riffs and, at its climax, Cassie Berman as a dispatcher reassuring the now-lost barge pilot to “send us your coordinates, I’ll send a Saint Bernard.”The best song on the album, “Suffering Jukebox,” is also the most traditionally structured. It manages to profile in its lines a lonely, unplayed jukebox in the corner of a smoky bar, and metaphorically connects it to the plight of the working musician. “They always seem to keep you way down low,” sings Cassie, “the people in this town don’t want to know.” Berman tries to understand in this perfect chorus:_Well, all that mad misery must make it seem true to you. But money lights your world up. You’re trapped. What can you do? You got Tennessee tendencies and chemical dependencies. You make the same old jokes and malaprops on cue._“Suffering jukebox in a happy town,” mourns Cassie, finally. “You’re over in the corner breaking down,” and on we go, through the world that Berman and band have created, one that overflows with a sense of profound joy at capturing in lyrics and song the beauty of creativity, and, by extension, honoring the unknowable Other from which it is born. == Spacelab ==By: Jeff HassayDavid Berman’s sixth album as The Silver Jews, Lookout Mountain, Lookout Sea, trades in his previous alt-country sound for a newer bat-shit crazy one. Crazy, but never menacing or chaotic, never punk or noisy. It is focused but unpredictable, like a curve ball thrown by a smirking pitcher that hits the batter in the crotch. Did he mean to do that? He isn’t telling.Berman still reigns as the southern, literary, and acrobatic version of Leonard Cohen. Lookout Mountain somehow maintains a tone of Dr.-Strangelove-like lighthearted doom. In lesser hands it would come off as pretentious and confused, but it works here as a rethinking of classic rock mixed with a 90s college band (Pavement?) playing a long-lost Dr. Seuss children’s album.Straddling the line between darkness and humor is nothing new for the Silver Jews. They have always maintained a playful tone in their songs, sometimes to the fault of the song (see \"Rebel Jew\" or \"Honk if You’re Lonely\"). What they do here is constantly bob and weave from high to low, from candy jail and a party barge to a suffering jukebox and a “dark and snowy secret”. Animals also appear frequently, from the Babar-esque elephant on the album’s cover to squirrels, a cobra, and a Saint Bernard. These, along with Berman’s persistent poetic-slash-comedic ability to turn a phrase, make Lookout Mountain into something like a psychedelic fairytale filled with elusive morals, “Tennessee tendencies, chemical dependency”, and the “same old jokes and malapropos” (it rhymes in the song).Berman’s playful absurdity and conscious move from the country vibe in the last few albums may seem like a step back from Tanglewood Numbers, the Silver Jews’ stellar previous album which, Berman wasn’t shy to admit, came after some hard times (drug addiction and a suicide attempt). While Tanglewood had light moments, it had many more thunderingly serious images and themes, ending in a place “past the blues”, with an apocalyptic suicide while seeing God’s scary shadow darken the world. Berman’s followup reminds me a bit of Steinbeck's Cannery Row: when it was released a few years after Steinbeck's dark classic The Grapes of Wrath, some people saw it as a minor work, one critic calling the book a creampuff. Steinbeck said that one needed to realize it was a \"poisoned creampuff\". Perhaps Lookout Mountain is Berman's \"poisoned creampuff\"."
},
{
  "title": "Bright Flight Reviews",
  "body": "== THE GIFT OF TRAVEL: Silver Jews, 'Bright Flight' ==By Kathleen Wilson for The Stranger.I've never been the type to find something to get depressed about within truly uplifting content. For example, I've always become secretly contemptuous whenever Harry Nilsson's \"Everybody's Talkin'\" comes on and some groaner starts wailing about what a depressing song it is. Sure, Midnight Cowboy is a dispiriting film, and it's difficult to separate the song from the soundtrack. But lyrically - however ironic the film's course makes it seem - the song remains, at its heart, a gorgeous, hopeful promise of brighter places. I experience the same uppity reaction when wistful artists such as Simon Joyner, Rock*A*Teens, the New Year, and Silver Jews are, in my opinion, wrongly referred to as bleak.Now, more than ever, what we all need is a promise of brighter places. A promise to get away. An opportunity to see things happen in states we've never been to. Transportation. Right now, though, most of us are apprehensive about travel, and whether it's because we're scared shitless or just low on cash, a lot of us don't have plans to go anywhere for a good long while.Which is what makes an album like the Silver Jews' Bright Flight the perfect gift for someone who needs to be transported without leaving the confines of home. Any Silver Jews record is fraught with picturesque visions, set forth by lead band member David Berman, whose crooked prose and wandering melodies read like vivid chalk paintings scratched on a sidewalk by a storyteller who's mastered the art of quick, inspired illustration.Like snapshots of a trip, Berman's deeply Southern lyrics catch the nearly missed poignancy in a simple rhyme such as \"Marry me, leave Kentucky and come to Tennessee/'Cause you're the only ten I see.\" It's the earlier, off-hand revelation that her doorbell \"plays a bar of Stephen Foster\" that unfurls a lifetime of intimate details, and the listener becomes an emotional patron of this imaginary couple set on moving ahead.In \"Room Games and Diamond Rain,\" Berman's got you drinking wine in the afternoon shade, imagining a freight train that rattles a chandelier, and taking a ride in the dirt. If that's too mundane, a moment later he's got you thinking about plug-in reindeer whose cords can't stretch far enough to fly. Whimsical sadness, mixing with the wine and the shade and the dirt, transports the listener to the kind of escape reality can't allow. Horses' legs become brown shotguns, and countrysides have trapdoors where you can disappear among giant evergreens. Suddenly a January trip to Mexico seems shallow and boring.Berman is also an acclaimed poet, whose book Actual Air reads like a novel written in two-sentence paragraphs. His observations are searing and economical, poignant, and, more often than not, hilarious. An on-duty museum guard muses, \"No one gets hungry at the sight of a lush cornfield or a herd of cattle. It's enough to tell you that we're full of education, not awareness.\" Again, Berman is offering a windshield view of the countryside, as seen through the eyes of a character we'd never have a chance of knowing except through a storyteller's proxy.Silver Jews began in 1989 when Berman, Stephen Malkmus, and Bob Nastanovich were living in New York after studying at the University of Virginia. Concurrent with Pavement, Silver Jews were often thought of as a Malkmus side project, but Berman's talents led the band. After Chicago's Drag City label released two super lo-fi EPs, Berman returned to college and studied writing, only to rejoin Malkmus and Nastanovich in 1994 on Starlite Walker. The following album, The Natural Bridge, was the one on which Berman's stark songwriting and streamlined musicianship came to the fore. Those abilities remained strong on 1998's American Water, the album on which the singer was reunited once again with Malkmus.Bright Flight is Berman's purest testament to his singular talent. The songs within are devastating and reviving in their ability to transcend time and place. The stories told and the places visited are rich with radiant imagery--not always happy, but encouraging in their pure, honest existence. \"One day they were cutting flowers for something to do/On the band of the road 'neath the cottonwoods/He turned to her to ask if she'd marry him/When a runaway truck hit him where he stood.\" The guy lives, she marries someone else, and Berman sings, \"I'm just rememberin', I'm just rememberin'.\" And, like we were there, we'll remember it too.== Bright Flight / Tennessee ==By Jillian Steinberger for Neumu.In over a decade, the Silver Jews (AKA David Berman and whoever he chooses to record with) have never quite fit into the musical landscape, existing in a genre twilight zone, subverting the codes. Berman makes his own rules and doesn't always follow them. His roots are in the music of American youth when he was coming up in the '80s — punk. He records for Drag City, an indie label. On both his latest album and his EP, Berman identifies most closely as a countrified artist — although his music is beyond country and alt.country and tacitly offers a criticism of both.Berman's often compared to rock heavyweights. Bob Dylan, for example, although they don't share much beyond common ancestry and a voice with a bit of scratch. Lou Reed? That might be valid, since the band has an early seven-inch called \"The Silver Jews and Nico\" (1993) — but it's not. While they've been compared to Neil Young, The Jews are not like Neil Young — they are wry, post-modern. As for Tom Waits, Berman's voice is hardly the same gravelly bear, and the songs differ vastly in tone and texture. And although the Silver Jews have been seen as a Pavement side project (members of that now-defunct über-indie supergroup play on previous albums, but not this one), it isn't. The Jews are so often misunderstood.There's a boho masculinity about the Silver Jews' music. Lore has it the \"band\" (originally called Ectoslavia) began as a trio of University of Virginia, Charlottesville, graduate students (Berman, plus ex-Pavement members Stephen Malkmus and Bob Nastanovich) sitting among beer cans and cigarette butts, inventing lo-fi tunes for friends. Eventually they moved to New York and left the little songs on people's answering machines (including Sonic Youth's, whose number they reputedly finagled from a girl at a record store).While his sometime bandmates dabbled with stardom, the apparently incorruptible Berman has stuck to his indie roots. He refuses to tour, saying he's not a performer, and live performances offer no value above and beyond the recorded songs. Yet he does make appearances, drawing caricatures at record stores, most recently in New York (Kim's on St. Mark's Place) and London (Rough Trade, for one quid). Very common-sense in Berman's world.An MFA in Creative Writing and published poet, Berman emphasizes the lyric, with no shortage of attention to songwriting or musicianship. He is the author of \"Actual Air\" (Open City, 2000) and numerous pieces in that beloved Situationist rag, The Baffler. Richard Brautigan, psychedelic beat author of deep teen fave \"In Watermelon Sugar,\" comes up regularly as a comparative reference.At Berman's request — and to their purported disappointment — Malkmus and Nastanovich have taken a break from the latest project, although word is they'll return for future recordings. To protect the Silver Jews from the continued perception of Pavement-side-project status (the opposite could be argued), Berman opted for experienced studio musicians. Props to them; they play beautifully together and with Berman. William Tyler plays acoustic and electric guitar, while Lambchop member Paul Niehaus, who has sessioned with Yo La Tengo, adds slide and twang with wave table and pedal steel guitar. Keyboards go to Tony Crow (Lambchop). Michael Fellows (Royal Trux, Rites of Spring) returns with his bass from the Jews' 1998 release, \"American Water,\" with drummer Tim Barnes. Cassie Marrett adds a welcome female dimension, and Berman has found his vocal female doppelgänger in her sweet, textured, country-punk voice.Closer listenings, particularly to the LP, reveal how grounded it is in its sense of place and history. Overall, the new work seems to be about movement and making tough choices — having the courage to live life according to one's vision and determining one's destiny. It is about what happens if you don't. It is about yearning — to be a better person, for communion with another, for a better world. It is about when the masculine joins the feminine and the worthwhile challenges of negotiating long-term romantic partnerships. It is packed with images — screen doors banging in the wind, freight trains rolling West, God when he was young, plug-in reindeer, floating hatchets and rhinestone suits. It is about the South — a condemnation of hypocrisy, rednecks, horseracing, guns and throwing in the towel too early. And it recalls and questions the meaning of American history.The songs are by turns tender, sweet, sexy, wry, tragic and mournful. Some are romantic (\"Tennessee,\" \"Room Games and Diamond Rain\"), while others are spiritual (\"Slow Education\", \"Death of an Heir of Sorrows\").\"Slow Education\" opens Bright Flight; the album's first lyrics soothe the weary adult soul (\"When God was young, he made the wind and the sun/ And since then, it's been a slow education\"). \"Everybody's going down on themselves\" in this NC-17 lullaby, featuring Berman's none-too-scratchy vocals and Marrett adding a pretty backup. I like the rhythm, the keyboards are right on, the guitars dish out the perfect twang, and even George Washington makes an appearance.\"Room Games and Diamond Rain\" follows. Again, the rhythm's on the mark and that same pretty twang from \"Slow Education\" weaves in. The song's about settling into romantic commitment; the affecting melody and rhyming lyrics might get schmaltzy (\"You keep finding and reminding me/ That you only can be kind to me\"), but the chorus takes it in other direction, presenting a kaleidoscope of compelling images (\"It's a fox hunt, it's an f-stop/It's a ten-acre wood\") that balance the song out. Sweet but contemplative, \"Room Games\" is one of my favorite songs on Bright Flight. I like how it sounds, what Berman talks about and the way he expresses himself — it's tender, but not saccharine.Some of Berman's songs have an onomatopoetic quality. Many songs in the history of country have sounded like trains (Johnny Cash's \"Folsom Prison Blues\" is a good example). On Bright Flight I do believe I've heard my first horse-galloping song, the instrumental \"Transylvania Blues\" — horse-galloping music from a fourth-generation, Southern Fried, American Jewish perspective. (Overall, the instrumentals are respites from the intense lyricism of the songs.)The 4-song EP, \"Tennessee,\" was a teaser released two weeks before the 10-song Bright Flight. I figure Berman didn't include the other tracks on the album because they didn't fit Bright Flight's narrative thrust. On both the EP and LP, \"Tennessee\" is the centerpiece, the heart, of the new work.Berman conveys his agenda with two unsubtle lines, \"Punk rock died when the first kid said/ 'Punk's not dead, punk's not dead.' \" (A friend argues that it died when Joe Strummer got his teeth fixed.) With this shout-out, D.C. says he's not working in a vacuum. He's drawing from tradition (punk), but he's not stuck in it. Berman appeals to youth as if to say, \"Think for yourself. Invent new forms; don't trot out the old tired forms.\" It's an important message, and typical Berman.In \"Tennessee\" the narrator hits the road with his gal pal and flees to Nashville. Acoustic guitar lends a folky feel, while electric guitars provide a twangy lead and an airy Western texture. Marrett's voice and delivery are perfect on this duet.The line, \"Louisville is death\" has caused speculation that Berman uses \"Tennessee\" to reveal a distaste for this significant village in the world of indie, one that developed while living with his girlfriend while she finished school. Louisville's indie stars include Berman's Drag City label mates, Will Oldham (Bonnie Prince Billy, Palace) and David Pajo (Papa M/Aerial M, Slint, Tortoise), neither of whom play often in their hometown. Bob Nastanovich has claimed that Louisville is only good for compulsive gamblers, and that the punk and indie scenes have died. The image of \"Horseleg Swastikas\" and lyrics like \"My horse's legs look like four brown shotguns\" (\"Time Will Break the World\") evoke a town populated by fascists perverting nature at the racetracks. Hence, the male voice's desire in \"Tennessee\" to make for Nashville, where he can juggle with the rubble of Southern music and build something new.On the EP, \"I'm Gonna Love the Hell Out of You\" is a sexy number heavy on guitar, tambourine and Berman telling a story about a \"Christian rock ingénu\" who wants to \"love the hell out of you.\" Where are those Nancy Sinatra boots when you need 'em? This song makes you want to stomp around on the table tops. If you don't know how that feels, listen and you'll know. The most fun of Berman's new crop, it works on the EP but would have disrupted the flow of the somber, introspective LP. A demo was originally released as a Jane Magazine CD.Berman originally drew me in with a deja vu line that captured a previously unarticulated concept: \"We're trapped inside the song,\" he and Malkmus wailed in \"New Orleans\" on 1994's Starlite Walker. Now I'm trapped inside Berman's latest project. And I love this rebel Jew.[Note: Bright Light gets an \"8\" rating; the \"Tennessee\" EP gets a \"6\" rating.]== Silver Jews - Bright Flight ==By Greg Peterson for The Independent Mind.:I am trying to get at something:and I want to talk very plainly to you:so that we are both comforted by the honesty.:-D.B. The first thing I noticed about this album was the Webb Pierce LP in the back photo. Then I noticed the little scorpions on David Berman's blue western shirt. Right now I'm looking at the front cover and thinking that the notebook pictured there is sitting on the couch with good posture, its back very straight. Bright Flight is the fifth full length from Silver Jews, who are not a Pavement side-project. If you didn't figure that out a long time ago, you should be figuring it out now. I heard someone say once that it's actually the other way around. Silver Jews existed before Pavement, and they're still existing now that Pavement is gone. Pavement's S.M. was not involved in making Bright Flight or The Natural Bridge, which was the third album. S.M. has an ear for perfect angular guitar lines that stick in your head like burrs on flannel, and for silliness. David Berman, on the other hand, writes poems (refer to Actual Air, Open City, 1999). The difference between his songs and poems is that the latter rhyme less often. A word on the silliness: here it has been carefully sewn up with nostalgia and melancholy. The lyrics are perhaps more direct than ever, but still the songs evaporate at their end (or mid-song, only to be re-assembled in a new way, as in \"I Remember Me\") and leave this listener with a certain mood rather than distinct memories or impressions. Some lyrics on a common theme: that one idea again, the one about dying; die until it doesn't hurt; time will break the world; killed you in my mind so many times before; chased by a floating hatchet; punk rock died…; death of an heir of sorrows; you'd died alone. All the best country music sounds to me like it's coming from someplace beyond this life, even if the singer is still living. (Example: Lambchop's Kurt Wagner. Note: Lambchop's occasional member Mark Nevers engineered and produced Bright Flight, giving it that special Nashville sound, if you're one to believe that a sound can linger in a locale like fog in a valley.) And maybe that's the problem with a lot of what passes for country music today. No one sings about death anymore. And please don't tell me that you're a Ryan Adams fan. But now I'm sounding bitter. These songs are not bitter. The pedal steel floats above them like an angel: child-like hope rolled up with a jaded acceptance of the end. Berman's deadpan sung-spoken delivery hits right between your eyes with the headphones on, and half the time he seems on the verge of tears. When he says \"I'm drunk on a couch in Nashville,\" I believe him. His songs are the best when you can sing along with him, and here's the verse that I learned first (join me when you can)::I wish I had a thousand bucks:I wish I was the Royal Trux:But mostly I wish I was with you.:-D.B. "
},
{
  "title": "American Water Reviews",
  "body": "== Dazed & Confused, No. 48, November 1998 ==\"While some folk have been hammering square pegs into round holes trying to assemble a kind of low-fidelity, new country movement, bands like Silver Jews have carried on obliviously and have created one of the most beguiling records of the year.Silver Jews third album, American Water, uses the forms and conventions of country and folk music without sinking into a stylised retro mire. Their work excels because, at a time when so many musicians rely on older forms of music to authenticate and window dress their increasingly tired artform, Silver Jews use traditional music as a canvas on which to paint their own unique impressions, \"there's a responsibility in folk and country traditions to add to that tradition'\" states Jews main man Dave Berman. \"I think most people that play country music have dropped the ball just by fetishising it.\" The remarkably tall Berman sucks a bloody mary through a straw while he explains and theorises about his music with wit and intelligence that befits the bands intriguing and elegant work. American Water fuses Bermans poetic eye with the cubist pop sensibilities of his band partner, Pavements Stephen Malkmus. With a book of poems due out in the new year, it's no surprise that Bermans lyricism is the major contribution to the bands achievement. \"I see the music as a pedestal for the stories in the songs,\" says Berman, \"But I want it to be as interesting as it can be before the point of intrusion. The music should be as simple as the stories are complex.\"Berman is particuarly concerned with maintaining a truth and honesty in his work: an emphahsis on presence or charisma over manufactured or sanitised personality. \"I don't make soundtracks to someones life. I'm not interested in making the listener the star. I still believe in the speaker and the listener, but I don't demand that anyone listens,\" he laughs. \"I offer it out and if anyone wants to listen they can.\"== Pitchfork Review ==by Zach HammermanAfter a dozen enjoyable listens, I popped American Water into the car stereo this weekend while cruising the hills of San Francisco and waited for a weak track. Forty- eight minutes and three record stores later I drove home convinced that D.C. Berman has crafted this autumn's most incredible record: twelve portraits of the American landscape that simultaneously beg to be played at every hour of the day, and reclaim the word \"poetry\" as part of the musical vocabulary. You heard it here first, folks. The Silver Jews have evolved from a Pavement side project into a full- fledged contender for the American indie throne.American Water reunites Berman with Pavement frontman Steve Malkmus. It's not surprisingly then that most of the songs sound like they would have been just as at home on the last Pavement album, Brighten The Corners. The big difference? Someone must have convinced Malkmus he was Tommy Verlaine, because he delivers some of the most focused, inspired guitar work he's ever done. And then there's the addition of ex- Royal Trux bassist Michael Fellows, whose bluesy approach and punchy bass lines add immeasurably to the album's pastoral, timeless flavor. A muted horn solo here and some added textures there keep the arrangements fresh. It's obvious that a lot of thought went into this record, and every move pays off.From the opening song, \"Random Rules,\" you know the Silver Jews are onto something big, something which, in Berman's words, should be \"hospitalized for approaching perfection.\" The first half covers considerable territory, from the midnight execution epic \"Smith and Jones Forever\" to the journey from Malibu to South Dakota in \"Federal Dust.\" In the lilting pop ditty \"People\" Berman reels off in his laid-back twang one of many strokes of lyrical genius::      People ask people to watch their scotch.:      People send people up to the moon.:      When they return, well there isn't much.:      People be careful not to crest too soon.On the album's second half, the Silver Jews expand their magna cum Pavement sound to include honky tonk (\"Honk If You're Lonely\" is sure to become a college radio classic) and a few Dylan-esque takes on the rambling blues (\"We Are Real,\" \"Like Like The The The Death\"). As the titles suggest, it's not always clear what the heck Berman is singing about. But in the pauses, and in the obtuse phrasing of questions like, \"Is the problem that we can't see, or is it that the problem is beautiful to me?\": somehow you know what he means.Just how good is this album? A few years back I bought Silver Jews CDs to pass the time between Pavement releases. Now things may be the other way around. So all hail the Chosen People. It's time to take off your clothes and skinny dip in the American Water.== Poetic Comedians Craft Charming Album ==Reviewed by Douglas Wolk for !SonicNet.D.C. Berman's odd, wonderful little band the Silver Jews used to get dismissed as a Pavement side project, thanks to the presence of Steve Malkmus and occasionally another member or two of the better-known band. So last year's fine disc The Natural Bridge was entirely Pavement-free; his point made, Berman has invited Malkmus back for American Water, and it's their most entertaining and least difficult disc to date. Berman is a poet who's obsessed with American history and only incidentally a musician, though he's good at it; the artless charm of his voice is often bolstered by Malkmus' quasi-harmonies here, but his strummy, midtempo jangles are deceptively deep, avoiding easy structures and pop-song tropes. His language works the same way (for some of his poetry, have a look at the Drag City-published 'zine The Minus Times) - if the lyrics weren't printed in the booklet, his best stuff would seem a lot more normal than it is.As you'd expect, there are some marvelous, arty, weird-as-hell lines here, like \"The birds of Virginia are flying within ya/ and like background singers they all come in threes.\" More seriously, though, he sings about wanting to \"hold the world to its word,\" and his best songs are about trying to construct meaning from words in a world, and specifically an America, that tends to defy them. Song after song mentions a city or state, only to move on to another one in a line or two. Sometimes, his language avoids meaning altogether - one song begins \"Like like the the the death/ Air crickets air crickets air crickets air crickets air\" - but more often it skirts around meaning, as in \"Blue Arrangements,\" a vague dance around the idea of shyness and passing into maturity.Fortunately, Berman has some help from Malkmus, who, if he doesn't exactly have a habit of getting to the point, at least likes to act like what he's getting to is the point. His voice and guitar lines are unmistakable - musically, American Water's conversational murmurs and midtempo guitar eruptions are a logical next step to Pavement's Brighten The Corners, and the instrumental \"Night Society\" could be the tail-end of a successful Pavement jam. And the lines of lyrical and vocal influence seem to run both ways. It's hard to tell who's singing the coda of \"not much water coming over the hill\" again and again in \"Federal Dust\" or who came up with the idea of preceding it with the line \"here comes the coda.\"Which leads to another thing that people tend to miss about the Silver Jews: how damn funny they are, and how dry that funniness is. American Water's spine hosts a great little joke, which I won't spoil here. \"Honk If You're Lonely Tonight\" is either a swell country song or a swell parody of a country song, and most likely both. Berman's jokes, and his more general embrace of absurdity-through-poetry, make sense as a response to a country that's too big to be held together by an idea of place, and they try to compensate by holding themselves together through barely meaningful language.== The List == by Paul WhitelawDavid Berman and Pavement's Steve Malkmus return with their third album of minor chord classics. American Water's stories are of tired travellers, jilted lovers and especially dedicated drinkers. It keeps a fairly respectable late Velvets pace, with occasional gear shifts in it's more Pavement-esque moments such as 'People' and the strangely titled 'Buckingham Rabbit'. Elsewhere the darker side of coffee house life is explored in the Mid-West phobia of 'Federal Dust'. But the greatest moment doesn't arrive until 'Honk if you're Lonely', an hilarious bumper sticker inspired, C&W pastiche with a catch-line of 'C'mon toot your horn and flash me those lights, Honk if you're lonely tonight'. Another future classic.== Mojo Review ==by Sylvia SimmonsWriter-cartoonist David Berman reunites with Pavement's Stephen Malkmus for third album.When David Berman recruited a band to play his songs, he called upon college pals Malkmus and Bob Nastanovich of Pavement fame. Then, though going on to christen their first three albums, dispensed with their services after Silver Jews' debut, Starlite Walker, cutting the more introspective The Natural Bridge two years later. Now Malkmus is back in fold, and American Water sounds like a cross between his early outings and Berman's short-story songs and flat, world-weary voice (All my favourite singers couldn't sing\", he croons in We Are Real; and I couldn't agree more) coalescing with Pavementy flourishes and Malkmus's backing vocals. At times it's like Will Oldham and a down-at-heel Lou Reed discussing love, life and death at an after hours bar. Sharp lyrics (\"I know a lot of what I say has been lifted from men's room walls\"), smart, distinctive pop and fine alt country best sampled on the melancholic Federal Dust and good-ol'-boy sing-along Honk If You're Lonely.== Philadelphia Weekly, October 1998 ==by William RicchiniOften thought of as a Pavement side project, country-folksters the Silver Jews is really southern poet/songwriter Dave Berman. For the fourth Silver Jews record, American Water, Pavement's Stephen Malkmus returns for lead guitar after sitting-out for Berman's last effort, the terrific The Natural Bridge. American Water is easily the most fully realized collaboration between Malkmus and Berman yet. Berman's gorgeous country-tinged ballads are designed to showcase his lyrics, but Malkmus makes the most of the minimalist arrangements, adding subtle guitar lines he'd never play on a Pavement record. Malkmus has his hands all over this record, most noticeably on \"Send in the Clouds,\" where Malkmus' riffing lures Berman's folk into anthem rock. But amidst the added sonic punch, the best thing about this record is Berman's words. His conversational southern drawl delivers his bumper sticker proverbs with elegance. He still can't sing worth a damn, but when he chants \"all my favorite singer couldn't sing\" on \"We Are Real\" you can hear a chorus of Dylan fans cheering in approval."
},
{
  "title": "The Natural Bridge Reviews",
  "body": "== From Q magazine (UK) ==by Danny EcclestonPoetic eccentric David Berman did himself few favours when he invited Steve Malkmus to aid him on his 1994 debut: in a year proliferating Pavement side projects, Starlite Walker from the ho-hum factor. Temporarily Pavement-free, the Virginia based thirtysomething's second effort, backed with delicately strange altern-country by a quartet of unknowns, is marked by greater clarity and confidence. Berman's conversationally related, endlessly droll reflections rendered more compelling than ever. \"The Latin teacher always smelled like piss.\", he recalls. \"We saw B.B. King on General Hospital\", he lies. \"Our record just went aluminum.\" he snickers, not inaptly. If the tremendous Dallas is anything to go by, he'll need a bigger bushel to hide his light under from here on in. ****== From Rip (US) ==Silver Jew David c. Berman is, quite possibly, related to both ESPN's Chris Berman and visionary film maker Ingmar Berman. Who else could make music that swellscinematically with a desperado's longing while asking, \"Is it true your analyst was a placekicker for the Falcons?\"This is the Jews second listenable album, a first meating with a long lost cousin who turns out to be a wonderful crackpot and new best friend. Named Jebediah probably. The songs sound like they're sitting on a rocking chair with whiskey in its dowling rods and noseeums breeding in the cushion, which is to say it's homey, homey.So the record's great- tuneful, understated, rolling like a river, a bit Bob Dylan, a bit Bill Murray, a bit Richard Braughtigan. Lets get onto the real issue at hand, which is that since the last record D.C. Berman's grown a beard. In the whole history/travesty of facial hair in rock, Berman's beard is one of the best, first because it accords him a certain Abe Lincoln-like dignity (important when singing lyrics like \"I believe that the stars are the headlights of angels driving from heaven to save us\"), secondly because it's full, trimmed, and dark- no purple streaks, no goatee, no bits of chipped beef lodged in the middle.As far as name drops falling on your head, some dudes from Pavement used to be in this band. They're not anymore and it doesn't matter. If this record had come out when I was in high school, instead of auditioning for Oklahoma!, I would've headed downtown, tried to rent a room in a transient hotel and shot the moon full of glory-holes. Now that, like Jeannie C. Riley said, is plum good enough for pudding.!!!!! - P.R. Much more coherent than the last outing. David Berman's tales of weird people are pretty much as amusing as before, but the music is much more orchestrated, with real lines this time out. While the sound is fuller, the effect is to make the lyrics even more spooky. Everything sounds almost normal. That's when you notice exactly what the hell Berman is singing about. Yow. There are four other Silver Jews, by the way. Berman just happens to write and sing and such. The other folks have filled their roles more than admirably, fleshing out the vision that Starlite Walking merely hinted at. Boy, do I like this album. I'm not sure where the Silver Jews are going next, but they've got me following the whole way. Folks have often compared this band to Pavement (a band I'm not crazy about). Yeah, but the Silver Jews are much better. There is vision here. For years, since they shared members with the better-known group Pavement, D.C. Berman's Silver Jews have been cursed with the tag of \"a Pavement side-project\" which, while understandable, is about as fair as calling the Velvet Underground \"an Andy Warhol side-project.\" The Pavement connection has surely brought a fair amount of attention to the Silver Jews' recordings, but the music itself has always been carried by Berman, a non-Pavement member, and one of the most talented songwriters anywhere. Finally, with The Natural Bridge, perhaps Berman will get his due, because, for the first time, there are no Pavement members involved. It's a Berman showcase on all levels, and it's thoroughly excellent. Over a lazy, country-tinged background, Berman acts as poet and storyteller, with a seemingly limitless supply of bad-luck lines like \"When I go downtown / I always wear a corduroy suit / 'cause it's made of a hundred gutters / That the rain can run right through,\" or the more succinct \"The stars don't shine upon us / We're in the way of their light.\"Mike Norenby James KeastVirginia's Silver Jews may be best known in indie rock circles as a side project for a good chunk of Pavement, but The Natural Bridge is going to change all that. Having ditched his more famous bandmates, David Berman has gathered a new gang, and the plan is to wait till dark, and then all of them are gonna ride in, bust through the doors of that there saloon, take care of that evil fucker what done their woman wrong, and get outta town. The vibe here is definitely low-down filth music, slow, dirgy country tinged songs with bizarre, unconnected imagery that is sharp in the moment, but in the long term means pretty much nothing. It don't matter. The music is enough to pull you through any of these low times you've been feeling, on Sunday afternoons that are kinda pleasant and sunny, but you still don't want to go outside — you want to dream of the rain, and mud, and the darkness in men's hearts. David Berman's right there with ya. His combination of indie-rock twists, country vibe and simplicity, and the story-telling music of early Leonard Cohen or Tom Waits, make for a lamentable stew of discontent. And sometimes there's nothing you want more."
},
{
  "title": "Starlite Walker Reviews",
  "body": "Great pop music that simply keeps rolling down the river. Everything seems so simple at the surface, you get lulled into a false sense of complacency. Oops. See, like many a Drag City act, the music and the lyrics are both poetic. The whole has a meaning unto itself. If you think you get it the first time, then think again. There's another meaning. Which is right? Listen again and find yet another passageway. That's what good poetry can do to you. It would be too easy to label Silver Jews' sound as hypnotic pop, but then, it does relax your mind and invite your subconscious to stop by for tea. Of course, Silver Jews claim no responsibility for what you do while under the influence of their music. After all, lawsuits can be nasty."
},
{
  "title": "The Arizona Record Reviews",
  "body": "== Nadine Magazine, February 1994 ==by Josh GennetOn what do we base our categories? One man's Deicide is another man's Indigo Girls, I guess. Some recent discussion of the Silver Jews' The Arizona Record has made it painfully clear that there is some disagreement on what makes for good \"pop-rock.\" No surprise. The fact that Spin just called Drag City America's best record label didn't have much effect on how my friends regard this album -- some didn't believe I'd spent money on such crap, and some didn't believe I'd scored such a find at Cutler's.So what do the Silver Jews sound like? An analogy: if Pavement spent the night sitting around drinking 40-ouncers and listening to VU albums, then decided to go jam and record it on a boom box with a normal-bias tape from Radio Shack that someone had lying around, hitting pause between songs, then took that tape to have it mastered for CD, it would probably sound a lot like The Arizona Record. If this sounds like a good thing to you, I guess it is. Truth be told, I like this a lot and think the songs are amazing. Truth be told, it is far and away the worst recording I have ever heard. Ever. And of course it's on CD, winning the Biggest Waste of Digital Audio Technology award hands down.For some strange reason, the last song on the Silver Jews album, \"The Bar Scene from Star Wars,\" sounds disturbingly Cocteau."
},
{
  "title": "Silver Jews - Tanglewood Numbers",
  "body": "Gather 'round, Silver Jews fans and detractors, and hear the tale of David Berman's past four years. After intentionally overdosing almost two years ago - despite the well-received 1999 poetry book ''Actual Air'' and 2001 album ''Bright Flight'' - Berman is back. On ''Tanglewood Numbers'', he's reunited with on-and-off again band members Stephen Malkmus and Bob Nastanovich (former Pavement drummer Steve West is also on this LP) and a host of others from his Nashville neighborhood and beyond. Berman's descent into drugs and the requisite redemption hasn't changed everything about the Silver Jews, but it's changed a lot. The heartrending aspects (childlike wonder, grown-up wit) of Berman's vocals and lyrics are intact. Malkmus' guitar still perforates the most pognant, aching moments and one-liners (\"How can I love you if you won't lie down?\") like a bayonet to the gut. Cassie Berman features prominently on vocals (a twangy, clear foil to her husband's deep growls), and the production is built to withstand the layers  created by the 15 or so players. What's missing most will probably not be missed at all: Berman's tendency to sound slack, sluggish and a bit lackluster. He cares more now, and caring always hurts more but yields better results.MAGNET contacted Berman in his Tanglewood Street home.'''It's been four years since ''Bright Flight''.'''For a lot of reasons, I just sunk deeper into drugs and just waited around to die. Eventually, I decided to finish the whole thing off. The rest is somewhat predictable: detox, rehab, God, comeback, confetti, hush money, sexposé, prosecution, bartending school.'''Were you working on ''Tanglewood Numbers'' before you overdosed?'''No. I lost about three years of work, in the sense that I didn't do any. I started writing these songs last July, after I'd been home about six months.'''Your wife's singing plays a larger role than ever. Does that reflect a permanent change in the Silver Jews' lineup?'''Things change and change back. I never like when bands changed for good, letting you know they'd never be the same again. I want the band to be the same again when that's what the song needs. For the people who love the Silver Jews, we will be their rock. That's a new guarantee.'''Your albums tend to inspire love/hate reactions. Do you hope ''Tanglewood Numbers'' will change that?'''I hope it gets to those who have ignore the band or have been discouraged from listening to the albums. As for the haters, let them picket the awards dinner when I'm inducted into the Rock And Roll Hall Of Fame. I can just see it now. It's January, in the future, and old (rock critic) Jim !DeRogatis is all bundled up against a bitter wind coming off Lake Erie, steam coming out of his maw. He's breathing hard, leaning against a frosted flagpole, with a rough-hewn picket sign fallen at his feet. It is only then that you notice he's bleeding.'''Is it true you're about to begin writing your first novel?'''No. I could never write a novel. I feel a moral responsibility to do the work I'm best at.[http://www.dragcity.com Drag City]"
}
]