[
{
  "title": "News 2005",
  "body": "== October Born ==From http://www.dragcity.com:Big news drops in October — in case you hadn’t already heard, October 18th is the date that the new Silver Jews opus Tanglewood Numbers becomes available to a world that has desperately needed more love from the Jews! You see, Silver Jews are a tradition to the young and semi-young of our global village — they quote David Berman’s lyrics, incorporating them as catch-phrases into their impressionable lives, fashion their lifestyles after what they imagine Silver Jews’ albums to be espousing and burn their favorite songs onto mix-CDs that they seek to influence others with, the cheap bitches! Ah, what we wouldn’t do for this fandom...it seems like the least we could do (literally) to release an album every four years or so from one of Drag City’s most celebrated of bands.Tanglewood Numbers is a celebration of life, played by more living creatures than ever before featured on a Silver Jews record. For all you dweebs out there: yes, Steve Malkmus is one of those creatures. And this helps to make Tanglewood Numbers one of the electric Jews records — as opposed to the more acoustically-flavored Bright Flight, let’s say. At times, the electricity is a bit shocking — but at the end of the day, it’s a great new Silver Jews record, full of life and death and beauty and humor and all the rest. Viva Tanglewood Numbers! It’s loaded with some of the greatest Silver Jews music.== Psst... ==From http://www.dragcity.com:Hey, American friend - wanna buy a really rare record? If you’re near a fine Drag City direct retailer, you’ll have a chance to buy one on October 18th. See, that’s the day Drag City’s little sister label Sea Note issues a mystery single so strange and mysterious...let's see, so strange and mysterious, we can’t tell you a single thing about this single! Well, perhaps just one little note — this record is related to our big October 18th release and a rumor that’s spread for some years over a collaboration with this band and another band on Drag City. That’s all we’re telling you - put together the pieces and five dollar bills and be the first in line - and you too might have this rarest of items!== Silver Jews vs. The Mountain Goats ==The CD accompanying the latest issue of The Believer magazine includes a version of Pet Politics played by the Mountain Goats. For more details visit: The Believer== False Alarm ==From http://www.donewaiting.com:All masters were located in another part of the building which received little to no fire damage. Whew!== Up In Smoke ==From NME:The studio Jeff Buckley was recording in when he died has been destroyed by fire.The Easley !McCain recording studio in Memphis suffered considerable damage after an electrical fire broke out on Wednesday last week (March 2).\"The (fire) inspector said that two fires broke out at the same time at opposite ends of the building, due to some electrical reason,\" engineer Kevin Cubbins told Rolling Stone. \"Within 15, 20 seconds, the whole place was engulfed.\"The studio has witnessed sessions by Sonic Youth, The White Stripes, Guided By Voices, Wilco and Loretta Lynn among others.Along with damage to the studio the new album by the band Silver Jews - which features former Pavement members - was also destroyed. The record had apparently been delivered to the studio to be mastered on the morning of the fire (see update).The studio’s future is now uncertain while the insurance is being examined, however Wilco bassist John Stirratt insisted it would a great loss.\"It's unbelievable. Really, really sad,\" he explained. \"If you tried to record in Memphis before Easley, you had to work with, well, born-agains. Easley was the first place to reflect how hip and weird and diverse Memphis really is -- the great, weird underbelly.\"== Punks in the Beerlight ==From The Dust Congress:Info on the upcoming Silver Jews album, from the main Jew:We won't be finished until Feb.24th. So it should come out around July. i'm giving a reading at sarah lawrence on thurs nite at 9pm. bring a walkman and ill let you listen to what it sounds like so far. the working title is \"tanglewood numbers\"you know \"woodchilde masquerade\" had it's chances. and i know what you're thinking-but remember \"the natural bridge\" is THREE words.the players in order of appearance::mike fellows:steve malkmus:brian kotzur:bob nastanovich:bobby bare jr.:steve west:duane denison:azita youseffi:will oldham:pete cummings:tony crow:paz lenchatain:j.d. wilkes songs are called ::sleeping is the only love:there is a place:punks in the beerlight:how can i love you (if you won't lie down?):the poor the fair and the good:animal shapes:i'm getting back (into getting back into getting back into you):sometimes the pony gets depressed:k-hole:the farmer's hotel:brian's song:freezing in the shadow of your knee:region ten re: is it the last silver jews album? Impossible! as long as two of us walk the earth the band is still together. and, as always, thanks to you that give a damn about what we do."
},
{
  "title": "News 2004",
  "body": "== Actual Air Hardback ==From http://www.dragcity.com: When you get tired of listening to CDs and outgrow wearing baseball caps (it'll happen someday, little Charlie), check out the Book Nook. That's where copies of the limited hardcover edition of David Berman's Actual Air can be found. We've placed them in shops around the globe and are offering what we have left to you, the mailorder customer. Priced to move at $28 (list price is $36!), this a great opportunity for you to buy the several extra copies to give away to friends and potential lovers around the high holidays. Shy a gift? Time to book it.== The Unnatural Bridge ==Boston band, The Stairs, have covered The Natural Bridge in its entirety. Each song has been reinterpreted in a surprising way and the album entitled The Unnatural Bridge. For more information, visit their website: http://benchappel.net/thestairs/index.php== The Believer ==Starting with the June issue, The Believer, published by Mcsweeney's, will feature a poem by David Berman every single month. See http://www.believermag.com for more details.== Dean and Britta vs. Silver Jews ==On June 3 Jetset Records released \"L’Avventura\", a new album by Britta Phillips and Dean Wareham that features a cover of Random Rules. For more information visit www.deanandbritta.com"
},
{
  "title": "News 2003 and Before",
  "body": "== Actual Air On Stage ==From http://www.infernalbridegroom.com:18th February 2003. Infernal Bridegroom Productions kicks off the new year with the first in a series of four consecutive world premiere productions, and the indie rock world is already buzzing about it.Having introduced Houston audiences to the works of Suzan-Lori Parks, Brian Jucha, Sarah Kane, Wallace Shawn, Mac Wellman and several other theater artists who represent the most exciting work happening in contemporary theater, IBP has found another outstanding playwright in rock and roll poet David Berman.  And, as was the case with our recent production of The Kinks’ Soap Opera, people from around the country are already booking their tickets.David Berman is a hero.  He is a hero to fans of independent music and he is a hero to the fans of contemporary American poetry.  Moreover he is a hero to longtime IBP company member Troy Schulze, who is uniquely suited to bring Berman’s poems to life and make believers out of the uninitiated.  Berman is best known for his work with The Silver Jews, a band which featured members of the legendary rock outfit Pavement.  As the story goes, Silver Jews mate Stephen Malkmus, of Pavement, was so impressed by Berman’s third record that he became disillusioned.  According to Malkmus, “It was such a better record than Terror Twilight [Pavement’s last release]. Much more inspired. After American Water, I could no longer make a record the way [Pavement] made records.”  In his book Actual Air, Berman has accomplished a similar feat: reawakening the listless world of American poetry, taking sly observatons on life’s mundane rigors and twisting them into mythic, witty, passionate anthems.  Berman's journey through a weird, dreamlike America is amusingly strange, yet it's strikingly familiar and precise. Pulitzer Prize-winning poet James Tate described Berman's poems as \"beautiful, strange, intelligent and funny ... narratives that freeze life in impossible contortions.\"Berman’s a hero, alright.  He’s a hero of the most exciting variety.  The sort you may never have heard of but you’ll almost certainly never forget.Troy Schulze joined the IBP company during it’s second production, in 1994.  In the time since, he’s played featured roles in 2 dozen productions, and was voted Houston’s best actor this year by Houston Press readers. In 1999, he directed Bernard- Marie Koltes' Roberto Zucco also for IBP. Houston Press theater critic Lee Williams wrote: \"[IBP's] exquisite world of wonderland shows just gets curiouser and curiouser and smarter and smarter. And the thrilling intellectual puzzle of their latest endeavor, \" Roberto Zucco,\" is as good as it gets.\"  Schulze is a funny sort of director.  Although his directing debut was an unmitigated success, he waited three years before mounting his sophomore effort.  He was looking for a project which demanded his attention and his unique, visually arresting style.   He found it in Actual Air.Schulze's stage adaptation of Berman's book is a collage of American snapshots – a surreal anti-narrative decorated with striking visuals, hilarious dialogue and live rock music, which is somehow simultaneously bizarre and accessible, soporific and dynamic.  As in the best of poetry, plays or music, it is the stuff dreams are made on.  Simply put, it’s the sort of work Infernal Bridegroom exists to produce: fresh, bold, challenging, entertaining, brand new poetry in motion for the next generation.In a pressurized cabin on the moon, a robot asks his maker about the relative sentience of snowmen.  In another scene an omniscient voice summons “all students named Doug” to a mysterious concourse.  In another a young man paints a self-portrait as a present to himself, meditating on simple pleasures and comforting himself with such thoughts as “at least I have not woken up with a bloody knife in my hand.”  As another sly rock poet once observed, something is happening and we don’t know what it is.  But something is absolutely happening.   It’s poetry made live again.  It’s theater made poetry.  And Infernal Bridegroom, and fans of David Berman from across the country, couldn’t be more excited.Ten years and forty-one shows after it all began, Infernal Bridegroom Productions is in its first full season in its very own theater doing what we've been doing all along.  Only more.   And better.  Actual Air is the first of four world premieres, to be followed by a collaboration with Bobbindoctrin Puppet Theatre (The Noblest of Drugs), a new work by IBP artistic director Jason Nodler (Meat/BAR) and the eighth in our ever-popular Tamalalia series.Actual Air will be playing at the Axiom, 2524 McKinney, at 8:00 p.m. on the following dates: February 13, 14, 15, 20, 21, 22, 27, 28, and March 1, 6, 7, 8. Opening Weekend, February 13, 14 and 15, tickets are only $5.99. Remaining performance ticket prices are as follows: Thursdays $10, Fridays $12, Saturdays $15.== Silver Jews T-shirt Bonanza ==Drag City have two splendid new Silver Jews t-shirts for sale! They're $14.00 each plus postage. Click here for more details. 	== Big chords, sweet melodies and (sometimes dubious) wisdom ==Typically, Silver Jews is the warmest, most homespun music of all the US stuff we represent; legendary leader DC Berman dropping the big chords, sweet melodies and (sometimes dubious) wisdom in equal parts. Bright Flight is a little different, a little the same - I read something about it that stuck with me, where the spin is that it's a little wilder and a little less kind than the Wild Kindness we experienced on the previous set, American Water. Maybe that's true, and the Nashville Joos sure sound lived-in, but DCB is incapable of sounding over-familar, naturally incorporating George Washington, Stephen Foster and Royal Trux into the best lyric schemes you're going to get outside hip-hop. Also Tennessee may well be the ultimate Joos track, if you ever need to turn a friend on to this incredible group in a hurry. And if it fails, well would you really want a friend who doesn't love this group? == Silver Jews Take Bright Flight To The Near Future ==Whenever we hear the sound of Silver Jews, it always seems to come from another time, a moment in the near future, perhaps. Their songs are like predictions that come true — moments of déjà vu played backwards, instantly familiar, making us nostalgic for a past that hasn't quite let go yet. Well, it's time for Silver Jews fans to prepare for such moments of time travel in the immediate future... around November 20th, to be precise! That's the day the new release Bright Flight will be made available, like an IV, to all the fans out there. This time, you'll have two new titles to choose from: not only the new 10-song Bright Flight LP/CD, but also a 4-track 12\"/CDEP called \"Tennessee.\" This 12\" is a cut from the record with three cuts not from the record adding up to a mini-trip all of it's own — who are you kidding, there's no choice! You've got four purchases to make an LP, CD, 12\" and CDEP! Start slinging that rock ASAP!And the record is great. Keeping in the tradition of not repeating past poses, D.C. Berman has typed up a new set of profiles. He assumes them all on Bright Flight, assisted by a couple characters from the American Water sessions (Tim Barnes, Mike Fellows) as well as a number of talented players from the Nashville area, where Bright Flight was laid down. This is one of those lonely-sounding, make-you-cry Silver Jews records so get ready for a cold winter. With Bright Flight in hand, it will be a long, devastating, worthwhile experience. This could be humanity s last chance so please — don t fuck it up, you kids at heart. Reality just got a little more real.== Actual Air ==D.C. Berman's first book of poetry, entitled Actual Air, was published by Open City Press on July 1st 1999.    \"David Berman's poems are beautiful, strange, intelligent and funny. They are narratives that freeze life in impossible contortions. They take the familiar and make it new, so new the reader is stunned and will not soon forget. I found much to savor on every page of Actual Air. It's a book for everyone.\" - James Tate The book costs $12.95 and can be ordered on-line. There has been a small first printing. "
},
{
  "title": "News 2006",
  "body": "== Silver Jews New Years East Coast ==In an article on Pitchfork, [http://pitchforkmedia.com/article/news/38398/Silver_Jews_Kick_Off_Tour Silver Jews Kick Off Tour], after wrapping up the westcoast leg of their current tour, the Joos are coming back east for some dates around New Years in NYC and Northampton, MA.  These shows are currently unlistedon the band\'s webpage.  However, be assured at least one ticket has been purchased through Ticketweb for New Years Eve.UPDATE: Tour cancelled, due to band \"winterization.\"  Refunds from Ticketweb apparently will be processed automatically.  Here's the band's official announcement:[http://www.silverjews.net Notice: Snowshow]. Any grievances may be sent to: P.O. Box 160009, Nashville, TN 37216== Silver Jews in Plan B ==Silver Jews are on the cover of Plan B magazine's August issue, with a six page feature including a number of great photos inside. Order from [http://www.planbmag.com/order planbmag.com/order].== O Captain! My Captain! ==Nextbook.org's latest podcast is a rare audio interview with David Berman in which he talks about the benefits of home ownership, religious and musical convergence in Nashville, and his growing interest in the Book. Berman also plays a new song he wrote to the lyrics of Walt Whitman's [http://en.wikipedia.org/wiki/O_Captain%21_My_Captain%21 \"O Captain! My Captain!\"]  Berman spoke with Nextbook's Sara Ivry just before heading to New York's Webster Hall where the Silver Jews were playing another sold-out show. Here\'s a link to the interview: [http://www.nextbook.org/cultural/feature.html?id=309 Silver Lining]== Notice of Collusion ==We suspect there has been a clerical error at MTV2, which, if it remains uncorrected, will have the Silver Jews (Cassie and David in this case) co-hosting a video show they have called \"subterranean\" next week in person. It will be shown on March 12 at midnight.They are hopefully going to play a \"Sleeping is the Only Love\" video that Brent Stewart (the fellow who made the \"How Can I Love You\" video) shot yesterday and edited last night, continuing to make a big name for himself in the under 100 dollar MTV-worthy video world.== Time Out Tel Aviv ==There's an article and video clip in the digital format of Time Out Tel Aviv. Check it out at:[http://digital.timeout.co.il/activemagazine/welcome/timeout_171.asp Time Out]== Silver Jews in Scotland ==Following much speculation, we're delighted to confirm that skewed rock idols The Silver Jews will play their first-everScottish dates at this year's Triptych festival. They play Edinburgh's Bongo Club on Thursday April 27 and Glasgow's Tramwayon Friday April 28. A London gig also takes place on Tuesday April 25.Performing live for the very first time in a celebratedfifteen-year career, enigmatic versifier David Berman and his endlessly erudite Silver Jews are finally set to gratify ears andenliven hearts with a clutch of inaugural Stateside shows in March; before crossing the water to woo Triptych aficionados andmusic lovers with their heady, hazy, hairy, grace. More information at: http://www.triptychfestival.com"
},
{
  "title": "News 2007",
  "body": "= The Silver Jew v. The Crash Test Dummy = [http://www.quickmuse.com QuickMuse] is a Boston-based website about writing and improvisation. Two poets are assigned a topic and they make up some on-the-spot verse. Then readers hit the \"playback\" button and watch the poems unfurl, letter by letter.  The first singer-songwriter event on QuickMuse will feature the Silver Jews' David Berman and Brad Roberts, of The Crash Test Dummies. - 26th May 2007 "
},
{
  "title": "News 2008",
  "body": "= Silver Jews \"Lookout Mountain, Lookout Sea\" =According to the Silver Jews Myspace page their new album, \"Lookout Mountain, Lookout Sea,\" is done and will be released in May. There will be a European tour starting that same month followed by an American tour in the fall.= Silver Jews to play ATP 2008 =Silver Jews are due to appear at the All Tomorrow's Parties Festival in May of next year.A recent post on the All Tomorrow's Parties website contained the following announcement:\"SILVER JEWS + JENS LEKMAN SIGN UP\\Do you like the Silver Jews? If so you are in luck because they have just confirmed they will play ATP in May alongside new confirmations Jens Lekman, Mono, Tony Teardrop and The Drift.\"The festival, which is curated by Explosions in the Sky, is held at Butlin's Holiday Centre in Minehead, Somerset UK.More details can be found [http://www.atpfestival.com/events/explosions/ here]= Monorail Film Club Presents... === THE HOLY MODAL ROUNDERS: BOUND TO LOSE and SILVER JEW ==This month Monorail Film Club turns it's attention to two generations of American underground music.The Holy Modal Rounders: Bound To Lose chronicles the wild forty-year history of 'The Rounders', who originated as a 1960's Greenwich Village psychedelic folk duo of Peter Stampfel and Steve Weber. Featured in the film are Dennis Hopper, former band member Sam Shepard, Peter Tork of The Monkees, Ira Kaplan of Yo La Tengo, The Fugs, Loudon Wainwright III, among many others.Silver Jew is an intimate portrait of sometimes reclusive poet/musician David Berman and his band the Silver Jews on their historic first visit to Israel in 2006.  For Berman this trip was always going to be significant and emotional and the film offers a unique insight into the charismatic word-genius as he performs his music in Tel Aviv and Jerusalem with a country-tinged incarnation of his group which includes his wife Cassie.Sunday 23rd September, 6.45. We very much recommend booking tickets in advance.http://www.gft.org.uk \\http://www.myspace.com/monorail_film_clubGFT, 12 Rose Street, Glasgow. 0141 332 8128"
},
{
  "title": "News",
  "body": "Welcome to the Corduroy Suit, a website dedicated to the music, poetry and writing of D.C. Berman and his band, Silver Jews. This website is a public wiki, which means visitors are encouraged to edit and update the content themselves. Please read the ((Contribution Guidelines)) for more details.= Buckingham Rabbit =A visitor to the Cord Suit has shared his instrumental cover version of Buckingham Rabbit: http://soundcloud.com/hollering/buckingham-rabbit-instrumental= Menthol Mountains =16th January 2011 - David Berman has started a blog: http://mentholmountains.blogspot.com= David Berman drawing published =A drawing previously appearing in David Berman's collection of drawings [http://www.dragcity.com/products/the-portable-february The Portable February] was published in the February 2010 issue of the e-zine [http://red-boldface.blogspot.com/2010/02/stuyvesant-bee-volume-1-issue-85.html The Stuyvesant Bee]. David Berman isn't credited, but in an interview with the editor Mike Topp, appearing on literary blog [http://htmlgiant.com/q-a/interview-with-mike-topp/ HTMLGIANT], he is quoted as saying \"David Berman gave me a a [sic] drawing for the February 2010 issue, which was exciting.\"= Silver Jews End =The two posts that follow were written by DCB on the Silver Jews Bulletin Board, 9 January 2009.== Silver Jews End - Lead Singer Bids his Well-Wishers Adieu ==Hello, my friend.Cassie and I went to the cave and it looks great. 58 degrees but the humidity makes it feel like 72.I'm just going to play fifteen songs. My fifteen favorite ones.A dollar per song. Plus Arnett Hollow. I don'twant to keep you underground for too long. Fall Creek Falls State Park State Lodge is great by the way its like the one from a place wherein they called Falls -  Yes I cancelled the South American shows. I'll have to see the ABC Countries another way.I guess I am moving over to another category. Screenwriting or Muckraking.I've got to move on. Can't be like all the careerists doncha know.I'm forty two and I know what to do.I'm a writer, see?Cassie is taking it the hardest. She's a fan and a player but she sees how happy i am with the decision.I always said we would stop before we got bad. If I continue to record I might accidentally write the song answer to Shiny Happy People.What, you thought I was going to hang on to the bitter end like Marybeth Hamilton?love david== My Father, My Attack Dog ==Now that the Joos are over I can tell you my gravest secret. Worse than suicide, worse than crack addiction:My father.You might be surprised to know he is famous, for terrible reasons.My father is a despicable man. My father is a sort of human molestor.An exploiter. A scoundrel. A world historical motherfucking son of a bitch. (sorry grandma)You can read about him here.http://www.bermanexposed.orgMy life is so wierd. It's allegorical to the nth. My father went to college at Transylvania University.You see what I'm saying.A couple of years ago I demanded he stop his work. Close down his company or I would sever our relationship.He refused. He has just gotten worse. More evil. More powerful. We've been \"estranged\" for over three years.Even as a child I disliked him. We were opposites. I wanted to read. He wanted to play games.He is a union buster.When I got out of college I joined the Teamsters (the guards were union organized at the Whitney).I went off to hide in art and academia.I fled through this art portal for twenty years. In the mean time my Dad started a very very badcompany called Berman and Company.He props up fast food/soda/factory farming/childhood obesity and diabetes/drunk driving/secondhand smoke.He attacks animal lovers, ecologists, civil action attorneys, scientists, dieticians, doctors, teachers.His clients include everyone from the makers of Agent Orange to the Tanning Salon Owners of America.He helped ensure the minimum wage did not move a penny from 1997-2007!The worst part for me as a writer is what he does with the english language.Though vicious he is a doltish thinkerand his spurious editorials rely on doublethink and always with the Lashon Hara.As I studied Judaism over the years, the shame and the shanda,grew almost too much. my heart was constantly on fire for justice. I could find no relief.This winter I decided that the SJs were too small of a force to ever come close toundoing a millionth of all the harm he has caused. To you and everyone you know.Literally, if you eat food or have a job, he is reaching you.I've always hid this terrible shame from you, the fan. The SJs have always stood autonomous and clear.Hopefully it won't contaminate your feelings about the work.My life has been riddled with Ibsenism. In a way I am the son of a demon come to make good the damage.Previously I thought, through songs and poems and drawings I could find and build a refuge away from his world.But there is the matter of Justice.And i'll tell you it's not just a metaphor. The desire for it actually burns.It hurts.There needs to be something more. I'll see what that might be.DCBif you want to know what evil Herr Attackdog is currently up to look here:http://www.alternet.org/workplace/120426/ad_wars%3A_%27dr._evil%27_vs._unions_over_employee_free_choice_act/== News Archives ==* ((News 2003 and Before))* ((News 2004))* ((News 2005))* ((News 2006))* ((News 2007))* ((News 2008))"
}
]