[
{
  "title": "Slow Education",
  "body": "When God was young, he made the wind and the sun\\Since then, it's been a slow educationAnd you got that one idea again\\The one about dying.Chorus: Oh oh oh I'm lightning\\Oh oh oh I'm rain\\Oh oh oh it's frightening\\I'm not the same, I'm not the same,\\I'm not the sameThere's a screen door banging in the wind\\Remember you wanted to be like George Washington back thenEverybody's going down on themselves\\No pardon me's or fare thee wells in the end(Chorus)© D.C.Berman, Civil Jar Music"
},
{
  "title": "I Remember Me",
  "body": "He almost walked into a wall\\Oh man she was a sight to see\\At the party down the hall\\He said \"you are the highest apple in the tree\"\\Out the window in the harbour he saw a little ship\\The moon was worn just slightly on the right\\They slowdanced so the needle wouldn't skip\\And he held her till the room was filled with lightI remember you and I remember me\\The sunshine walking inside you/and the man you could see in me.\\So I remember me and I remember you\\So many beautiful days in a row now and the nights were perfect tooHand in hand down a waterslide in Chattanooga\\They did not hide from love you see\\A winter's plane flight to Aruba\\Where he threw a boombox into the sea.\\One day they were cutting flowers for something to do\\On the bank of the road 'neath the cottonwoods\\He turned to her to ask if she'd marry him\\When a runnaway truck hit him where he stood.So I remember you and I remember you\\And I remember you do-do-do-do-do\\And I remember me and I remember me\\A blackhalk nailed to the sky/and the tape hiss from the trees.Everybody said she needed to move on\\That he was all but lost so deep was his coma.\\When he finally came to, the girl he loved was long gone.\\She'd married a banker and moved to Oklahoma.\\He bought a little land with the money from the settlement\\And he even bought the truck that had hit him that day\\He touched the part where the metal was bent.\\And if you were there you would hear him say.I remember her and I remember him\\I remember them and I remember then..\\I'm just rememberin' I'm just rememberin'© D.C.Berman, Civil Jar Music"
},
{
  "title": "Punks in the Beerlight",
  "body": "where's the paper bag that holds the liquor?\\just in case I feel the need to puke.\\if we'd known what it'd take to get here.\\would we have chosen to?so you wanna build an altar on a summer night.\\you wanna smoke the gel off a fentanyl patch.\\aincha heard the news? adam and eve were jews.\\and I always loved you to the max.I love you to the max!\\I love you to the max!\\I love you to the max!\\ if it gets really really bad\\if it ever gets really really badlet's not kid ourselves.\\it gets really really badpunks in the beerlight, burnouts in love.\\punks in the beerlight, toulose-lautrec.\\punks in the beerlight, two burnouts in love.\\I always loved you to the max!I love you to the max!\\I love you to the max!\\I love you to the max!\\I love you to the max!\\I love you to the max!\\I love you to the\\\\© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "Animal Shapes",
  "body": "gold and green/red and blue.\\are the lights on the signs that line charlotte avenue.\\from a corner window, I watch the falling white flakes.\\God must be carving the clouds into animal shapes.animal shapes, animal shapes,\\God must be carving the clouds into animal shapes.we've got no goodwill, no goodwill to give.\\to those who try to take away the things we need to live.\\friend, this is from your friend, offa natchez trace.\\the only dream left worth believing starts with animal shapes.animal shapes, animal shapes,\\nothing better get in the way of whatever it takes.later on, somewhere else, I said some things I didn't mean.\\I know everybody's on a first name basis with the king.\\from a corner window, I watch the falling snowflakes.\\God must be carving the the clouds into animal shapes.animal shapes, animal shapes,\\God must be carving the clouds into animal shapes.\\God must be carving the clouds into animal shapes.© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "K-Hole",
  "body": "I've been living in a k-hole.\\I've been living in a k-hole.\\ever since you went away.\\I've been down here day after day.I'd rather live in a trash can\\than see you happy with another man.\\closed sign swinging in the window of the liquor store.\\better get inside the kingdom and close the door.andre was a young black santa claus.\\he didn't want to be like his daddy was.\\better take the gun with you when you go.\\he'd rather be dead than anything he knows.girl in the special economic zone.\\girl in the special economic zone.\\closed sign swinging in the window of the liquor store.\\better get inside the kingdom and close the door.© D.C.Berman & Michael Fellows, (Civil Jar Music/BMI)/(Fantastic Hosses/SESAC)"
},
{
  "title": "Sometimes a Pony Gets Depressed",
  "body": "where does an animal sleep when the ground is wet?\\cows in the ballroom, chickens in the farmer's corvette.sometimes a pony, sometimes a pony, sometimes a pony\\gets depressed.how does an animal see once the sun has set?\\bandits in the capital. limited civilian unrest.sometimes a pony, sometimes a pony, sometimes a pony\\gets depressed.what kind of animal needs to smoke a cigarette?\\grass in the pasture is sharper than a bayonet.sometimes a pony, sometimes a pony, sometimes a pony\\gets depressed.\"happiness won't leave me alone!\" sings the bird in his nest.\\\"get a load of this fucking view, its the best in the west!\"sometimes a pony, sometimes a pony, sometimes a pony\\gets depressed.© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "How Can I Love You If You Won't Lie Down",
  "body": "fast cars,\\fine ass,\\these things\\will pass,\\and it won't\\get more\\profound.time is a game only children play well.\\how can I love you if you won't lie down?bayou.\\doorbell.\\who's who,\\in hell?\\my kingdown\\for a crown.time is a game only children play well.\\how can I love you if you won't lie down?© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "The Poor, The Fair and The Good",
  "body": "the river winds round these little green hills,\\and stays in the woods for days.\\we were built to consider the unmanifested,\\and make of love an immaculate place.I hear a smile and a tear in your voice.\\don't lay the groundwork for a case of remorse.\\when you feel that first ice cold twist in the wind.\\I'll come back by the way that I came.\\shot of dixie hemlock will take care of the pain.now a man keeps his money folded square in his pocket\\and doesn't take everything that he could.\\he'll rise like a lion and line himself up\\with the poor, the fair, and the good.when you feel that first ice cold twist in the wind\\will you hang a lamp at the end of the lane?\\black-eyed susans from the maryland shore.\\we'll trim back the thorns around the hospital door.\\more will be seen than will be understood.\\go with the poor, the fair, and the good.\\go with the poor, the fair, and the good.© D.C.Berman & Cassie Berman, (Civil Jar Music/BMI)/(Ganaan/BMI)"
},
{
  "title": "The Farmer's Hotel",
  "body": "the lights went out in New York, then they went in Goshen.\\I got stuck in Goshen and that was sad.\\the townsfolk stared hard like their minds had been marred\\by life in a district so downtrodden and drab.I flagged down a stranger in a worn wooden wheelchair,\\and when I asked if he knew of a hotel\\he said \"if I get your meaning, then I'm definitely leaning\\towards recommending the Farmer's Hotel.\"as I left to find the place, a mother looked me in the face\\and whispered \"please sir, not the Farmer's Hotel.\"\\once where I was headed, she swore I would regret it,\\what might happen she wouldn't foretell.the old place it was vicious, wicked and pernicious,\\\"please stay clear of that rank abattoir.\"\\though her words alarmed me, I was stuck until morning\\and in the end we must be who we are.with no light on the door, I wasn't quite sure\\if a night clerk was working within.\\from behind a red curtain limped a perilous person.\\he appeared to have some egg on his chin.this old yankee warlock brushed back a gray forelock\\and he motioned me to sign in the book.\\with no bonhomie he proffered the key.\\never once did he give me a look.I thanked the old codger, and in my role as the lodger,\\I headed upstairs for to sleep.\\there was no air of slumber, the doors they had no numbers\\which room was intended for me?the passage kept on going like the carpet was flowing\\towards that thing at the end of the hall.\\my own eyes had adjusted.\\my account can be trusted,\\cause I know that I saw what I saw.I heard animal noises and tangled up voices\\chanting more and of rumors of more.\\there's no natural law that can explain what I saw\\spread out on that straw-covered floor.now I've put an ocean between myself and Goshen\\to get away from the Farmer's Hotel.\\things so unclean, are better left unseen.\\keep away from the Farmer's Hotel.the lights went out in Goshen, just like poetry in motion,\\and I checked into the Farmer's Hotel.\\so if you get a notion to travel to Goshen,\\please stay away from the Farmer's Hotel.© D.C.Berman, Steve Malkmus & Gate Pratt, (Civil Jar Music/BMI)/(Treble Kicker/BMI)/(King Bunkley/BMI)"
},
{
  "title": "There is a Place",
  "body": "there is a place past the blues I never want to see again.\\there is a place past the blues I never want to see.black planet, black freighter, black sea:\\Police Conversation 1783I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this worldI could not love the world entire.\\there grew a desert in my mind.\\I took a hammer to it all.\\like an insane medieval king.I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this worldI could not love the world entire.\\there grew a desert in my mind.\\I took a hammer to it all.\\I took a hammer to it all.I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world\\I saw God's shadow on this world© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "Death of an Heir of Sorrows",
  "body": "I wish I lived in the Power and the Light\\I wish it wasn't Saturday night\\Cause I can't raise hell,\\no I can't raise hell for two.I wish I had a thousand bucks\\I wish I was the Royal Trux\\But mostly I wish, I wish I was with you.When I was summoned to the phone\\I knew in my bones that you had died alone.We've never been promised there will be a tomorrow\\So let's just call it \"the death of an heir of sorrows\"\\The death of an heir of sorrows.I have not avoided certainty\\It has always just eluded me\\I wish I knew I wish I knew for true.I wish I had a rhinestone suit\\I wish I had a new pair of boots\\But mostly I wish, I wish I was with you.We've never been promised there will be a tomorrow\\So let's just call it \"the death of an heir of sorrows\"\\The death of an heir of sorrows.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Let's Not and Say We Did",
  "body": "Let's go hunting blackbirds, let's throw snowballs from the bridge\\The fireplace burns backwards, let's not and say we did.\\There's a trapdoor in the country where we can disappear.\\These giant evergreens are a promise redeemed\\Let's walk down the glassy top of a frozen pasture stream\\Our minds can dream like soda machines\\And that's exactly what we did.Let's ride down the ridge to the military bridge\\You can't be against forever, let's not and say we did.\\There's a party in the country, where we can disappear.\\Dig if you will, a picture of you girl\\Finding the fiercest way to live\\We can ride all day in a one horse open sleigh\\And that's exactly what we did.\\And that's exactly what we did.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Friday Night Fever",
  "body": "I love the sound of a jukebox playing\\So I sit here, while she's staying home\\Watching Dallas on tv\\I love the taste of whiskey straight,\\The strongest thing she ever takes\\Is a sip from a small glass of chablisI've got that Friday Night Fever\\Sometimes a man just needs a breather\\She knows I love her and I need her\\And I'm no cheater\\I've just got that Friday Night FeverShe wouldn't change me if she could\\I wouldn't change her, she's too good\\Sometimes a man just needs a change of pace\\I've heard all those come on lines\\When I go home at closing time\\I know no one could ever take her placeI've got that Friday Night Fever\\Sometimes a man just needs a breather\\She knows I love her and I need her\\And I'm no cheater\\I've just got that Friday Night Fever© D.C.Berman, Civil Jar Music"
},
{
  "title": "Random Rules",
  "body": "In 1984 I was hospitalized for approaching perfection.\\Slowly screwing my way across Europe, they had to make a correction.\\Broken and smokin' where the infrared deer plunge in the digital snake.\\I tell you, they make it so you can't shake hands when they make your hands shake. I know you like to line dance, everything so democratic and cool,\\But baby there's no guidance when random rules. I know that a lot of what I say has been lifted off of men's room walls.\\Maybe I've crossed the wrong rivers and walked down all the wrong halls.\\But nothing can change the fact that we used to share a bed\\and that's why it scared me so when you turned to me and said: \"Yeah, you look like someone\\Yeah you look like someone who up and left me low.\\Boy, you look like somene I used to know.\" I asked the painter why the roads are colored black.\\He said, \"Steve, it's because people leave\\and no highway will bring them back.\"\\So if you don't want me I promise not to linger,\\But before I go I gotta ask you dear about the tan line on your ring finger. No one should have two lives,\\now you know my middle names are wrong and right.\\Honey we've got two lives to give tonight.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Smith & Jones Forever",
  "body": "Are you honest when no one's looking?\\Can you summon honey from a telephone?\\They sat there with their hooks in the water\\and their moustaches caked with airplane glue. O come let us adore themCalifornia overboard\\when the sun sets on the ghetto all the broken stuff gets cold. Chorus::Smith and Jones forever!:Smith and Jones forever!:Smith and Jones forever together forever and ever. Build a stage for Autumn's bitch.\\They walk the alleys in duct tape shoes.\\They see the things they need through the windows of a hatchback\\The alleys are the footnotes of the avenues. O come let us adore them\\California overboard\\holding up their trousers with extension cords. (chorus) I've got two tickets to a midnight execution.\\We'll hitchhike our way from Odessa to Houston\\and when they turn on the chair\\something's added to the air\\when they turn on the chair\\something's added to the air forever (chorus)© D.C.Berman, Civil Jar Music"
},
{
  "title": "Blue Arrangements",
  "body": "I see you gracefully swimming with the country club women\\in the Greenwood southside society pool.\\I love your amethyst eyes and your protestant thighs\\you're a shimmering socialite jewel. From the Carbon Dioxide Riding Academy\\to the children's crusade marching through the downtown.\\Well I think I'd die see, if you just said hi to me.\\When something breaks it makes a beautiful sound. Sometimes I feel like I'm watching the world\\and the world isn't watching me back.\\But when I see you, I know I'm in it too.\\The waves come in and the waves go back.\\The kids in the corner all covered in dirt.\\Caught trespassing under the moon.\\My father came in from wherever he'd been\\and kicked my shit all over the room. The room is dark and heavy with what I want to say.\\I see murals in the radio static and on your blue jeans.\\What would you say if I asked you to run away?\\It's been done so many times I hardly know what it means. I took these blue arrangements and threw them in the sea\\when older waves from older caves brought them back to me.\\I took these blue arrangements and stored them on a shelf.\\With change on the mantle and time in a candle,\\in the end a boy raises himself.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Federal Dust",
  "body": "They don't walk and they don't talk in Malibu.\\They don't vote and they don't even smoke.\\I know you're blue; They don't cream and they don't dream in Kansas City.\\They don't crack and they don't act.\\I know you're ready; They don't cry and they don't die in South Dakota.\\They don't match and they don't hatch in South Dakota.\\Here comes the coda. Not much water coming over the hill.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Buckingham Rabbit",
  "body": "Back then I had a Buckingham rabbit.\\I'd been lonely since she found Christ.\\Now is the time to depend on the law:\\the nights of my professional life,\\the nights of my professional life.I was living in a very young city.\\Grand piano, great lakes, good-bye.\\If you ask me my name, it's high-low-jack in the game.\\I can track a single bee to the hive. Every single game was a blowout.\\And the Nascar blurred into porn.\\Scenic this, scenic that,\\don't fall for the traps of the man who was never born,\\of the man who was never born.so the rent became whiskey,\\and then my life became risky:\\and so the rent became whiskey, whiskey\\shattered dogs on the rocks. At the back of the bar there's a couch\\where the lonely people go and lie.\\They talk to the honky tonk psychiatrist\\into the wee hours of the night,\\into the wee hours of the night. The factories on muscle relaxers.\\The pine perfume of hilltown floors.\\The lover, the thinker, the talker, the singer\\won't be lucid for her anymore,\\won't be lucid for her anymore. so the rent became whiskey,\\and then my life became risky:\\and so the rent became whiskey, whiskey\\shattered dogs on the rocks.\\shattered dogs on the rocks. When you know how I feel I feel better\\When you're 15 you wanna look poor.\\You do unto others, and run like a mother\\I don't wanna look poor anymore,\\No I don't wanna look poor anymore.Jesus in a runaway shelter,\\said \"The deaf have pictures of you.\"\\From the digital fountains to the analog mountains,\\let the mirror express the room,\\let the mirror express the room.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Rebel Jew",
  "body": "In the times I dream of Jesus\\it's like he's coming through the walls\\when I'm working at my desk at night\\I hear his footsteps in the hall you can believe me not believe me\\I'm just a bird upon the sill\\and these words just course right through me\\like water through a mill he was a rebel jew\\he was a rebel jew\\and he died for you and your sins\\he was a rebel jew\\he was a rebel jew\\let him in sometimes I dream of Texas\\yeah, it's the biggest part of me\\and the planes look like the sea at night\\oh, she wants to be so free she is a rebel state\\she is a rebel state\\and it's not too late for her to break\\from a sick, sick union\\an unhealed wound and separate all the time I dream of Michele\\and the towers in her mind\\some women lie down with killers\\oh, my baby's not that kind she is a real good girl\\yeah, she's a real good girl\\and she stops the world so I can't see\\that she's a good, good girl\\a good, good girl to me© D.C.Berman, Civil Jar Music"
},
{
  "title": "Pretty Eyes",
  "body": "Everybody wants perspective from a hill\\But everybody's wants can't make it past a window sill\\I can see you in your room at night\\Pictures on your walls\\Little forest scenes and high school Halloweens\\But they don't come to you\\They don't come to you at allAll houses dream in blueprints\\Our houses dream so hard\\Outside you can see my shoeprints\\I've been dreaming in your yard One of these days these days will end\\Thru the kitchen window the light will bend\\You'll be carving a pumpkin with a knife\\when someone at the table says\\\"That's not what I call a life!\" The elephants are so ashamed of their size\\Hosing 'em down I tell them \"you got pretty eyes\"\\Out in the backyard I used to make like I was a cowboy\\I'd set my dog before a hoop and say \"now boy, now boy!\" When the governer's heart fails\\The state bird falls from its branch\\Icicles on hell's higher hills\\Meanwhile back home at the ranch\\I still get up early in the morning\\And I never knew a better place I believe the stars are the headlights of angels\\Driving from heaven to save us\\To save us\\Look in the sky\\They're driving from heaven into our eyes\\And though final words are so hard to devise\\I promise that I'll always remember your pretty eyes\\Your pretty eyes© D.C.Berman, Civil Jar Music"
},
{
  "title": "How to Rent a Room",
  "body": "No I don't really want to die\\I only want to die in your eyes\\I'm still here below the chandelier\\where they always used to read us our rights I want to wander through the night\\as a figure in the distance even to my own eye\\Have you ever rented a room\\have you even ever rented a room?An anchor lets you see the river move\\but now that your evil dreams came true\\there on your face\\a row of teeth he'll come to replace I know you laughed when I left\\but you really only hurt yourself\\When you see your curtains move in the wind\\you can bet I'm betting against you again Cause I'm a man who has a wife who has a mother\\who married one but she loved another\\You're a tower without the bells\\you're a negative wishing well I should have checked the stable door\\for the name of the sire and dam\\you were always at the dogtrack\\with your brother and all his friends Chalk lines around my body\\like the shoreline of a lake\\Your laughter made me nervous\\it made your body shake too hard Now there's a lot of things that I'm gonna miss\\like thunder down country and the way water drips\\when you're running for the door in the rain\\read the metro section...see my name No I didn't really want to die\\I only wanted to die in your eyes\\Grant me one last wish\\Life should mean a lot less than this© D.C.Berman, Civil Jar Music"
},
{
  "title": "We Are Real",
  "body": "Up the hill past 694, at the stone wall make a left,\\and I will see you soon my friend if these old directions still direct.\\Is the problem that we can't see or is it that the problem is beautiful to me?\\The birds of Virginia are flying within you\\and like background singers they all come in threes. Won't soul music change\\now that our souls have turned strange.\\Once a day, twice a day\\And when on and off collide\\we'll set our souls aside and walk away. We've been raised on replicas of fake and winding roads\\and day after day up on this beautiful stage\\we've been playing tambourine for minimum wage\\but we are real, I know we are real. Repair is the dream of the broken thing\\Like a message broadcast on an overpass\\all my favorite singers couldn't sing.My ski vest has buttons like convenience store mirrors\\and they help me see, that everything in this room right now is a part of me. Won't soul music change\\now that our souls have turned strange.\\Once a day, twice a day\\And when on and off collide\\we'll set our souls aside and walk away. Realizing is how it feels inside when it happens to you.\\So I took a shot of sugar like snow dumped into the blood\\and children wander off into the ultra-economic\\but we are real I know we are real.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Time Will Break the World",
  "body": "The sun and the shutters and the sun shattered hair.\\The butler hesitates at the top of the stairs.\\A kitten from Great Britain sleeps behind the drapes.\\An old silver bowl filled with apples and grapes.It's so very cold in the mansion after sunset\\Snow is blowing through the baseboard outlets.\\And I have no idea what drives you mister.\\tanning beds explode with rich women inside.All my poor hungry children x3\\Time will break the world x3The snow falls down so beautiful and stupid\\Fore the black silhouette of Abraham Lincoln trees\\The sky is low and gray like a Japanese table.\\And my horse's legs look like four brown shotgunsThe icicles are dripping like the whole house is weeping\\On an evil little car with gull-wing doors.\\And I have no idea what drives you mister\\But I've killed you in my mind so many times before.All my poor hungry children x3\\Time will break the world x3© D.C.Berman, Civil Jar Music"
},
{
  "title": "Black and Brown Blues",
  "body": "Baby let's get dressed up\\I got two pairs of shoes\\Darling you look so beautiful\\when your hair's all hung in jewels\\and sometimes I find it really hard to choose\\between a pair of black and a pair of brown shoes When I'm high on batwings\\up by the silvery moon\\I think of a certain sad eyed king\\trapped in his golden room\\and I dream of a cold river on the way\\to come and sweep that king into this black and brown bay Well the water looks like jewelry\\when it's coming out the spout\\and nothing could make me feel better\\than a wet kiss on the mouth\\Fake I.D.'s and honeybees\\the jagged skyline of car keys\\I never knew the bird could fly so low Rub out the catlight,\\rub out the village\\red and white exit light\\that's exodus damage\\Why don't people think of who they use?\\Why don't you try and come and get me:\\Black and Brown Blues It's raining triple sec in Tchula\\and the radio plays \"Crazy Train\"\\there's a quadroon ball in the beehive\\hanging out in the rain\\and when there's trouble I dont like running\\but I'm afraid I got more in common\\with who I was than who I am becoming When I go downtown\\I always wear a corduroy suit\\cause it's made of a hundred gutters\\that the rain can run right through\\but a lonely man can't make a move\\if he can't even bring himself to choose\\between a pair of black and a pair of brown shoes© D.C.Berman, Civil Jar Music"
},
{
  "title": "Pan-American Blues",
  "body": "a fifth on decoration day for the doctor\\that fixed my arm. The federales back\\from Tuscon, each one got an arm gone.\\Limehouse Pratt got dim inside, can't see\\the painted ladies runaround at night.\\A wood-paneled room, my cigarette fumes\\waltz and dissolve just for you.\\There's gonna be a truce(x3) but\\first you got to set your horses loose.\\A jaguar simmering in a cage, give him\\a chance, can you tell the answer from the\\ants. History's got it's walking papers\\can't get enough of the make-up\\that makes it look so tough.\\Well it ssssseems just like a freeze out (x3).an undisclosed, deeply wooded\\lose your way route.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Pet Politics",
  "body": "Guard my bed\\while the rain turns the ditches to mirrors\\by a vase of carnations from central Ohio\\where the looking machine can't hear us Deep in the night we dream of positions\\there's a line for the phone in the hall\\and in the cold places where Spanish is spoken\\most wars end in the fall You never know when your pet will go\\pet politics (x4) Still wearing last night's mascara\\now that her pet was gone for sure\\she was shivering so hard\\it looked like there were two of her I could see through the sleeve of her blouse\\the plans of her architect lover\\a tattoo of a boarded-up house\\and ink door that belonged to another When the rain hits you\\it hits you slow\\stitch after stitch (x4) Adam was not the first man 'though the Bible tells us so\\There was one created before him, whose name we do not know\\He also lived in the garden\\but he had no mouth or eyes\\One day Adam came to kill him\\and he died beneath these skies I find it so amazing how\\I go where I'm led (x4) I suspect we could be losing now\\please guard my bed\\please guard my bed\\please guard my bed\\please guard my bed© D.C.Berman, Civil Jar Music"
},
{
  "title": "Self-Ignition",
  "body": "oh self ignition, \\i can feel her suitcase sensing mine\\she was her own permission,\\miss nineteen ninety ninety ninety nine nine nine nine charles james sofa, and a household truce\\and there every wednesday night beneath the counter booth i woke up in a house i could understand\\the descendants of defendants were making demands. gently thinking backwards \\on the psychedelic promises god made to me in the dark\\some of these kids don't have words\\they're as helpless as parakeets in a park i couldn't believe it, when i saw that you wrote\\that a burning passenger shouldn't ruin the boat if dreams are your body telling you it's confused\\then i've got a dream i think you can use all lace and fiction\\in the lawless rooms where you finally lost your health\\i read the evening edition\\and the pumpkin on the porch is trying to heal itself i don't like magic, and i don't like tricks\\having a helluvah time believing we exist the mailman dreams he's paul revere\\he wants the whole town to buy him a beer and i have to remember that your not wanting me\\doesn't make me any less here© D.C.Berman, Civil Jar Music"
},
{
  "title": "Introduction II",
  "body": "Hello, my friends\\Hello, my friends\\Come on, have a seat\\Come on, in my kitchen\\My friends, take it easy\\My friends, have a seat\\My friends, don't you know that I never want this minute to end?\\And then it ends."
},
{
  "title": "Trains Across the Sea",
  "body": "Troubles, no troubles, on the line,\\I can't stand to see you,\\I can't stand to see you when you're crying at home.\\Scotch & penicillin, please try Carlton,\\a cold black maple hanger and husbands on the run\\I just got back from a dream attack\\that took me by surprise\\and in there I met a lady, her name was Shady Sides\\and she said:\\\"It's been evening all day long,\\it's been evening all day long\\and how can something so old be so wrong\".\\Sin and gravity\\drag me down to sleep to dream of trains across the sea,\\trains across the sea.\\Half hours on earth, what are they worth, I don't know.\\In 27 years I've drunk fifty thousand beers\\and they just wash against me like the sea into a pier.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Tide to the Oceans",
  "body": "Tide to the oceans\\a million chuckers never felt wrong\\looking at you, I'm a staring\\looking how you make me feel good now\\Broken like you know the child diction\\over at the naked show\\Sarah couldn't make you feel down now\\down, down, down, down, down, down, down, down, down now (chorus) Wait, for the last man\\last man never had a chance\\so he went out behind the shed\\and bought himself a little cigarettes\\On the ground digging for a treasure map\\find your answer\\when you ask, please ask me\\ask me to stay. (chorus)© D.C.Berman, Civil Jar Music"
},
{
  "title": "Self Portrait at 28",
  "body": "By David BermanI know it's a bad title\\but I'm giving it to myself as a gift\\on a day nearly canceled by sunlight\\when the entire hill is approaching\\the ideal of Virginia\\brochured with goldenrod and loblolly\\and I think \"at least I have not woken up\\with a bloody knife in my hand\"\\by then having absently wandered\\one hundred yards from the house\\while still seated in this chair\\with my eyes closed.It is a certain hill\\the one I imagine when I hear the word \"hill\"\\and if the apocalypse turns out\\to be a world-wide nervous breakdown\\if our five billion minds collapse at once\\well I'd call that a surprise ending\\and this hill would still be beautiful\\a place I wouldn't mind dying\\alone or with you.I am trying to get at something\\and I want to talk very plainly to you\\so that we are both comforted by the honesty.\\You see there is a window by my desk\\I stare out when I am stuck\\though the outdoors has rarely inspired me to write\\and I don't know why I keep staring at it.My childhood hasn't made good material either\\mostly being a mulch of white minutes\\with a few stand out moments,\\popping tar bubbles on the driveway in the summer\\a certain amount of pride at school\\everytime they called it \"our sun\"\\and playing football when the only play\\was \"go out long\" are what stand out now.If squeezed for more information\\I can remember old clock radios\\with flipping metal numbers\\and an entree called Surf and Turf.As a way of getting in touch with my origins\\every night I set the alarm clock\\for the time I was born so that waking up\\becomes a historical reenactment\\and the first thing I do\\is take a reading of the day\\and try to flow with it\\like when you're riding a mechanical bull\\and you strain to learn the pattern quickly\\so you don't inadvertently resist it. II two I can't remember being born\\and no one else can remember it either\\even the doctor who I met years later\\at a cocktail party.\\It's one of the little disappointments\\that makes you think about getting away\\going to Holly Springs or Coral Gables\\and taking a room on the square\\with a landlady whose hands are scored\\by disinfectant, telling the people you meet\\that you are from Alaska, and listen\\to what they have to say about Alaska\\until you have learned much more about Alaska\\than you ever will about Holly Springs or Coral Gables. Sometimes I am buying a newspaper\\in a strange city and think\\\"I am about to learn what it's like to live here.\"\\Oftentimes there is a news item\\about the complaints of homeowners\\who live beside the airport\\and I realize that I read an article\\on this subject nearly once a year\\and always receive the same image.I am in bed late at night\\in my house near the airport\\listening to the jets fly overhead\\a strange wife sleeping beside me.\\In my mind, the bedroom is an amalgamation\\of various cold medicine commercial sets\\(there is always a box of tissue on the nightstand). I know these recurring news articles are clues,\\flaws in the design though I haven't figured out\\how to string them together yet,\\but I've begun to notice that the same people\\are dying over and over again,\\for instance Minnie Pearl\\who died this year\\for the fourth time in four years. III three Today is the first day of Lent\\and once again I'm not really sure what it is.\\How many more years will I let pass\\before I take the trouble to ask someone?It reminds of this morning\\when you were getting ready for work.\\I was sitting by the space heater\\numbly watching you dress\\and when you asked why I never wear a robe\\I had so many good reasons\\I didn't know where to begin.If you were cool in high school\\you didn't ask too many questions.\\You could tell who'd been to last night's\\big metal concert by the new t-shirts in the hallway.\\You didn't have to ask\\and that's what cool was:\\the ability to deduct\\to know without asking.\\And the pressure to simulate coolness\\means not asking when you don't know,\\which is why kids grow ever more stupid.A yearbook's endpages, filled with promises\\to stay in touch, stand as proof of the uselessness\\of a teenager's promise. Not like I'm dying\\for a letter from the class stoner\\ten years on but... Do you remember the way the girls\\would call out \"love you!\"\\conveniently leaving out the \"I\"\\as if they didn't want to commit\\to their own declarations. I agree that the \"I\" is a pretty heavy concept\\and hope you won't get uncomfortable\\if I should go into some deeper stuff here. IV four There are things I've given up on\\like recording funny answering machine messages.\\It's part of growing older\\and the human race as a group\\has matured along the same lines.\\It seems our comedy dates the quickest.\\If you laugh out loud at Shakespeare's jokes\\I hope you won't be insulted \\if I say you're trying too hard.\\Even sketches from the original Saturday Night Live\\seem slow-witted and obvious now. It's just that our advances are irrepressible.\\Nowadays little kids can't even set up lemonade stands.\\It makes people too self-conscious about the past,\\though try explaining that to a kid. I'm not saying it should be this way. All this new technology\\will eventually give us new feelings\\that will never completely displace the old ones\\leaving everyone feeling quite nervous\\and split in two. We will travel to Mars\\even as folks on Earth\\are still ripping open potato chip\\bags with their teeth. Why? I don't have the time or intelligence\\to make all the connections\\like my friend Gordon\\(this is a true story\\who grew up in Braintree Massachusetts\\and had never pictured a brain snagged in a tree\\until I brought it up.\\He'd never broken the name down to its parts.\\By then it was too late.\\He had moved to Coral Gables. V five The hill out my window is still looking beautiful\\suffused in a kind of gold national park light\\and it seems to say,\\I'm sorry the world could not possibly\\use another poem about Orpheus\\but I'm available if you're not working\\on a self-portrait or anything. I'm watching my dog have nightmares,\\twitching and whining on the office floor\\and I try to imagine what beast\\has cornered him in the meadow\\where his dreams are set. I'm just letting the day be what it is:\\a place for a large number of things\\to gather and interact --\\not even a place but an occasion\\a reality for real things. Friends warned me not to get too psychedelic\\or religious with this piece:\\\"They won't accept it if it's too psychedelic\\or religious,\" but these are valid topics\\and I'm the one with the dog twitching on the floor\\possibly dreaming of me\\that part of me that would beat a dog\\for no good reason\\no reason that a dog could see.I am trying to get at something so simple\\that I have to talk plainly\\so the words don't disfigure it\\and if it turns out that what I say is untrue\\then at least let it be harmless\\like a leaky boat in the reeds\\that is bothering no one. VI six I can't trust the accuracy of my own memories,\\many of them having blended with sentimental\\telephone and margarine commercials\\plainly ruined by Madison Avenue\\though no one seems to call the advertising world\\\"Madison Avenue\" anymore. Have they moved?\\Let's get an update on this. But first I have some business to take care of. I walked out to the hill behind our house\\which looks positively Alaskan today\\and it would be easier to explain thisif I had a picture to show you\\but I was with our young dog\\and he was running through the tall grass\\like running through the tall grass\\is all of life together\\until a bird calls or he finds a beer can\\and that thing fills all the space in his head. You see,\\his mind can only hold one thought at a time\\and when he finally hears me call his name\\he looks up and cocks his head\\and for a single moment\\my voice is everything: Self-portrait at 28."
},
{
  "title": "New Orleans",
  "body": "I'm scared (I swear) of you.\\In the tunnel, in the darkness, the darkest walls of blue,\\there's beasts and there's men and there's something on this earth that comes back again: \\Alpha...delta....gamma... everybody's smoked\\You can't say that my soul has died away (x2)\\There's trouble in the hall and trouble up the stairs and trouble in the trouble\\that's troubling the air.\\Please don't say that my soul has died away. There is a house in New Orleans,\\not the one you've heard about. I'm talking about another house.\\They spoke of gold in the cellar that a Spanish gentleman had left.\\I broke in one hundred years ago with a dagger tucked in my vest.\\Legends of gold I've tried to hold in the grey half-lite of the halway at night\\one....two... three, four, five\\we're trapped inside the song. We're trapped inside the song (x3)\\where the nights are so long.\\There's traps inside us all (x3)\\and the nights are so tall.\\And the night is so tall.\\And the knife is so tall.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Ballad of Reverend War Character",
  "body": "Miss Mary Jane measures rain in a cracked cup on the sill\\In Embry's last photograph he disappears over a hill\\Darrell Dotson waits in the grass for a fight\\the stars don't shine upon us\\we're in the way of their light The new girl in Tahoe has swallowed Sinatra's cum\\A Russian primadonna dances slow on valium\\After the game the benchwarmer can't get a ride\\in space there is no center\\we're always off to the side John Parker III steps over a bird on a Wall St. window ledge\\Little Wilkie finds a dead cat rotting deep inside the hedge\\Mahalia Roach dies on a Greyhound coach in July\\in a horror movie when the car won't start\\you give it one last try Guinnevere orders one more beer in the smokey pick-up bar\\A burnt out tramp by the exit ramp waits for one more car\\The Latin teacher always smelled like piss\\the census figures come out wrong\\there's an extra in our midst© D.C.Berman, Civil Jar Music"
},
{
  "title": " Walnut Falcon - Live 1990",
  "body": "On a snowy mountaintop\\Two rams go head to head\\Horns go thwap\\Horns go thwap\\And I'm looking for my snowy bedI dream about, but I don't know the way\\I dream about the swarm\\I dream about the swarm\\I dream about the swarm\\I dream about the swarmWalnut falcon comes flying down\\Wing span as long as this town\\Seeds of prey in its little black eye\\I shift in looking for the dog in the rainAnd the walnut falcon will soar\\Into my heart, away from the ?Dream about the swarm\\Time is the lonely thing\\Time, time is the lonely thing\\Time, time is the lonely thing\\Time is the lonely thingI can dream about but makes me go away\\Dream about the swarm"
},
{
  "title": "Suffering Jukebox",
  "body": "cranes on the downtown skyline is a sight to see for some\\it ought to make a few reputations in the cult of number one\\while these seconds turn these minutes into hours of the day\\while these doubles drive the dollars and the light of day awaysuffering jukebox such a sad machine\\you're all filled up with (what) other people need\\and they never seem to turn you up loud\\got a lot of chatterboxes in this crowdsuffering jukebox in a happy town\\you're over in the corner breaking down\\they always seem to keep you way down low\\the people in this town don't want to knowwell I guess all that mad misery must make it seem to true to you\\but money lights your world up, you're trapped, what can you do?\\you got Tennessee tendencies and chemical dependencies\\you make the same old jokes and malaprops on cuesuffering jukebox such a sad machine\\you're all filled up with (what) other people need\\hardship, damnation and guilt\\make you wonder why you were even builtsuffering jukebox in a happy town\\you're over in the corner breaking down\\they always seem to keep you way down low\\the people in this town don't want to know"
},
{
  "title": "San Francisco B.C.",
  "body": "Old San Francisco, San Francisco B.C.\\I lived with my true love and she lived with me.\\\"Romance is the douche of the bourgeoisie\"\\Was the very first thing she imparted to me\\We had sarcastic hair, we used lewd pseudonyms\\We got a lot of stares on the street back then.Since her dad, a local barber, had been beaten to death\\She had become a vocal martyr in the vegan press\\The cops had failed, they couldn't catch a bus\\They were looking for a male with a bad hair cut\\Enter tumbleweed, exit love and our affaire d'amour\\Was set on self-destruct.She said \"you don't make enough to provide for me.\"\\I said \"what about the stuff that we quote believe?\"\\She said \"I left that on the sands of history\\I've found a new man to take care of me\\He dresses for success and emergency\\And he moves a lot of concrete on the QVC.\"Little, asian, deadly, like a cobra in the shade\\Sat in the midst of the smoke that he made\\His name was Mr. Games and he owned the place\\It was a lonely bar and grill in the Lower Haight\\He had a jeweler's hands and a blurry face\\He knew I needed a chance so he gave me a break.\"If I hire you now, can you start today?\\I got a high-rise job down by the bay.\\Just a couple of rocks and some firearms\\There's not many locks and just one alarm\\My step-son Gene will pick you up and drive\\Try to be his friend, he's got a friendly side.\"Doll-house lightning and the next thing I knew\\We were back at our point of rendezvous.\\I was in the possession of burglary tools\\Children's fur coats and diamonds and jewels\\Gene's talking about insignificant shit\\Just like crooks in the movies when they do that bit.He said the power of metal will never be harnessed.\\I thought the wages of metal should be heavily garnished.\\We were waiting for his dad to meet us there\\Gene took off his hat and I noticed his hair\\It was neatly trimmed but a patch was bare\\I knew it wasn't the wave, it was human error.Before I knew what I said, I said \"killer cut.\"\\I watched him silently putting out a cigarette butt.\\Then he came at me with some fist cuisine\\I had to duck aside and that was bad for Gene\\Cause when he went by me he tripped and fell\\Through the glass coffee table at the Wong hotel.Right there and then Mr. Games walked in\\With my ex-true love on his gamy limb.\\So her dad's killer's dad was her new beau\\And Games had a wife, whatta you know?\\She got real real quiet till we chucked the kid\\Then she went her way and I went his.Old San Francisco, San Francisco B.C."
},
{
  "title": "Candy Jail",
  "body": "Pain works on a sliding scale\\So does pleasure in a candy jail\\True love doesn't come around any more than fate allows on a Monday in Ft. Lauderdale\\I came all this way to see your grave\\To see your life as written paraphrased\\I have tried be it is written in the furnace of affliction\\This is what you couldn’t face.Life in a candy jail\\Peppermint bars\\Peanut brittle bunk beds and marshmallow walls\\Where the guards are gracious\\And the grounds are grand\\And the warden keeps the data on your favorite brands.Jelly beans and cookie dough\\Country restroom on a radio\\I got a number on my name\\It’s hard to rise above the shame\\I’m a branded man made in the mold.These terms engulf the waking mind.\\Like cherry, grape and lemon-lime\\Like candy corn and licorice\\Like bubble gum and Swedish fish\\It happens to me all the time.Living in a candy jail\\With peppermint bars\\Peanut brittle bunk beds\\And marshmallow walls.Where the guards are gracious\\And the grounds are grand\\And the warden really listens\\And he understands."
},
{
  "title": "Strange Victory, Strange Defeat",
  "body": "Squirrels imported from Connecticut\\Just in time for fall\\How much fun is a lot more fun?\\Not much fun at all\\What's with all the handsome grandsons\\In these rock band magazines?\\And what have they done with the fat ones?\\The bald and the goatee'd?Strange victory!\\Strange victory!\\Strange victory!\\Strange defeatA tale is told of a band of squirrels\\Who lived in defiance of defeat\\They woke up in the nightmare world\\Of craven mediocrity\\They said, \"We're coming out of the black patch!\\We're coming out of the pocket!\\We're calling into question\\Such virtue gone to seed!\"Strange victory!\\Strange victory!\\Strange victory!\\Strange defeatStrange victory!\\Strange victory!\\Strange victory!\\Strange defeat."
},
{
  "title": "What Is Not But Could Be If",
  "body": "What is not but could be if\\What could appear in the morning mist\\With all associated risk\\What is not but could be ifWhat was not but could have been\\Was my obsession way back when\\Now I just remember this\\What is not but could be ifWhat is not but could be if\\We could be crossing this abridged abyss\\Into beginningWhen failure’s got you in its grasp\\And you’re reaching for your very last\\It’s just beginningOne has lived life carelessly\\If he or she has failed to see\\That the truth is not alive or dead\\The truth is struggling to be saidSo how do we get out of this\\Family shadows all of this\\Through what is not but could be if\\With all associated riskWhat is not but could be if\\We could be crossing this abridged abyss\\Into beginningWhen failure’s got you in its grasp\\And you’re reaching for your very last\\It’s just beginning "
},
{
  "title": "Aloysius, Bluegrass Drummer",
  "body": "Aloysius was a bluegrass drummer\\He was just a normal kid\\Bloomin’, trippin’, flowin’ under\\Just as I once didAt a 24-hour restaurant\\Open to the end of time\\He was washing dishes there\\When he met Brick ButterflyShe was a no wave singer for a country act\\Working outta Region Ten\\She was all strung out on hard street fat\\But he didn’t know it thenFirst a look then a spark\\Sound of Velcro in the dark\\His heart is spinning like a bicycle wheel\\She and he laid the stems down flat\\In the middle of a fieldBrick Butterfly had a history\\Of sleeping with the kitchen staff\\She was a hardcore gobbler\\And a longtime guzzler of hydrogenated crapSuet, tallow, liquid squeals\\Great mounds of plastic lard\\That’s what she got the lad to steal\\On the night that he got firedAloysius woke at five a.m.\\The hungry girl was gone\\There was blood in the bedding\\Forks in the ceiling\\And bones all over the lawnLike any strong young poet would\\He packed his bags for Region Ten\\I guess now I know him less\\Than I ever knew him then\\Yes I guess I know him even less\\Than I ever knew him then."
},
{
  "title": "My Pillow Is The Threshold",
  "body": "I take decaf coffee\\Two sugars and one cream\\I don’t see the use in staying up just to watch TVI unplug all the neon\\Turn the ringer off the phone\\Throw my thoughts like tomahawks\\Into this world which I disownBecause the pillow that I dream on\\Is the threshold of a kingdom\\Is the threshold of a world where I’m with youIt’s a dark and snowy secret\\And it has to do with heaven\\And what looks like sleep is really hot pursuitI hold your picture in my mind\\It makes me warm when I am cold\\Gets me up and it makes me walk\\It makes me question what I’m toldSomewhere in a foggy atlas\\Lookout Mountain, Lookout Sea\\First life takes time then time takes life\\Now the next move’s up to meBecause the pillow that I dream on\\Leads to some fantastic glory\\It’s the threshold of a world I can’t ignoreLike time unspoiled from heaven\\Did you find me sleeping in your doorway\\Now I’m here for good\\I won’t leave you anymore. "
},
{
  "title": "We Could Be Looking For The Same Thing",
  "body": "Way way out past where the sidewalks disappear\\And up through bright blue blocks of sky\\Where the days turn to weeks in the months the year\\And we're together, you and I.We could be looking for the same thing,\\If you're looking for someone.\\We could belong to each other,\\If you're not seeing anyone.I hope I don't come across as a coyote in your eyes\\But I've been around some and I've seen\\Enough to know we could both spend happy lives\\Inside the days of you and me.We could be looking for the same thing,\\If you're looking for someone.\\We could belong to each other,\\If you're not seeing anyone."
},
{
  "title": "Party Barge",
  "body": "Father drove a steamroller\\Momma was a crossing guard.\\She got rolled when he got steamed\\And I got left in charge\\Living in a little town with my pedigree in shards\\I chopped down a weakened willow tree\\And built this party bargePorts of call, dayglo bait\\Why not see a legend while it's still being made?\\Think it's kind of squirrelly when you're sleeping in the park\\Jam too far propagating in the night\\My colleagues and associates have kicked out all the lights\\Like I said they say, nothing stops a party barge\"This is lake directory, calling party barge.\\I'm on the phone with pump control, they say you are at large\\Send us your coordinates, we'll send a Saint Bernard\"\\Think it's kind of squirrelly when you're sleeping in the park\\Chicken fried pigeon in a sunny jane sauce\\Satan's jeweled laughter has your wife in its claws\\Like I said they say, nothing stops a party barge\"Send us your coordinates, I'll send a Saint Bernard.\\Send us your coordinates, I'll send a Saint Bernard.\\Send us your coordinates, I'll send a Saint Bernard.\\This is lake directory, calling party barge.\""
},
{
  "title": "Open Field",
  "body": "Open field with a window\\Open field with no childOpen Field"
},
{
  "title": "Dallas",
  "body": "I passed out on the fourteenth floor\\the CPR was so erotic\\a blizzard blew in through the door\\and little glowing cum buckets in her ankles O Dallas you shine with an evil light\\O Dallas you shine with an evil light\\How'd you turn a billion steers\\into buildings made of mirrors,\\and why am I drawn to you tonight? Once you taste the geometry of a church in a cul-de-sac\\you're gonna wanna sit with the bad kids in the backCruising down Commerce\\killing time in the blazing sun\\Is it true your analyst was a placekicker for the Falcons?We saw B.B. King on General Hospital\\in the Oak Cliff dram house where we stayed\\and when Clancy whipped her with his belt buckle\\we cleaned her cuts and then we prayedO Dallas you shine with an evil light\\Don't you know that God stays up all night?\\And how'd you turn a billion steers\\into buildings made of mirrors,\\and why am I drawn to you tonight? Watching the makeup girls make out with the mannequins\\\"Hey boys, supper's on me, our record just went aluminum\" Poor as a mouse every morning\\rich as a cat every night\\Some kind of strange magic happens\\when the city turns on her lights© D.C.Berman, Civil Jar Music"
},
{
  "title": "The Country Diary of a Subway Conductor",
  "body": "\"O get him out of there!\" What if it cost 25c\\to wake up in the morning? A dollar, ten dollars?\\I'd pay it all the way to the poor house. It's not made\\if it's made in Roanoke. Night pulling up in front of\\the house like a bus. It came at me with shears. Her\\sweater had faces, famous faces knitted all over it.\\The porch swing ticked off Central Daylight time.\\\"How many hours do you think it'll take me to smoke this\\cigarette?\" she said with a smile. The smell of fried\\food came drifting out one of the castle windows.\\\"Lets go around back\" I said \"my brother buried some\\stuff back there.\" We ducked down and walked through\\the black bushes. My shoe made a sucking sound in\\the turf. \"He can afford anything\" I said \"he's got\\dogs that blow on trumpets.\" \"Priests!\" she cussed.\\Thunder cracks over Ben Franklin's shop. Who wrapped\\my dreams in a blanket and led them outside to the black\\book in the yard? \"Hey what indian tribe occupied\\southern california? They were a lucky bunch of fellers!\"\\Sting Bible, More Sea Bible, Knur & Spell. In moments\\downhill, towards sleep in the stillwater shop. Imagining\\places I was almost sure I'd never been & had taken to\\assuming were the memories of my grandfather somehow\\deposited in my mind. They were there and gone, just before\\I could get my bearings, catch any names or find out\\where the hotel was. Just a pile of glass shavings that\\could never be reassembled into the gone order\\of buildings & the shade pouring off of them. \"WATER!\"© D.C.Berman, Civil Jar Music"
},
{
  "title": "The Wild Kindness",
  "body": "I wrote a letter to a wildflower\\on a classic nitrogen afternoon\\Some power that hardly looked like power\\said I'm perfect in an empty roomFour dogs in the distance\\each stands for a kindness, yeah\\Bluebirds lodged in an evergreen altar\\I'm gonna shine out in the wild silence\\and spurn the sin of giving inOil paintings of x-rated picnics\\Behind the walls of medication I'm free\\Every leaf in a compact mirror (bye, bye, goodbye, bye)\\hits a target that we can't see (goodbye, bye, goodbye) Grass grows in the icebox\\The year ends in the next room\\It is autumn and my camouflage is dying\\instead of time there will be lateness\\and let forever be delayed I dyed my hair in a motel void\\met the coroner at the Dreamgate Frontier\\He took may hand said I'll help you boy (bye, bye, goodbye, bye)\\if you really want to disappear (goodbye, bye, goodbye)Four dogs in the distance\\each stands for a silence\\Bluebirds lodged in an evergreen altar\\I'm gonna shine out in the wild kindness\\and hold the world to its word© D.C.Berman, Civil Jar Music"
},
{
  "title": "The Frontier Index",
  "body": "Of all the people I knew\\I always looked up to you\\and after millions of years of crime\\the sun still shines and shines Look a horse (of course) gallops thru the desert light\\I make such good time through sub-space\\when I dream all day and ride all night A robot walks into a bar\\orders a drink\\lays down a bill\\The bartender says, hey we don't serve robots\\and the robot says, oh but someday you will Prison's a good time for some\\many people get caught with a gun\\This trucker says it's good to be free\\says he knows lots of folks who agree Bumperstickers talk to him\\say \"let the stars get in your eyes\"\\Time, cum, sand, and surf\\these are the building, building blocks of life Boy wants a car from his Dad\\Dad says, first you gotta cut that hair\\Boy says, hey Dad Jesus had long hair\\and Dad says\\that's right son, Jesus walked everywhere When I was younger I was a cobra\\in every case I wanted to be cool\\Now that I'm older and sub-space is colder\\I just want to say something true© D.C.Berman, Civil Jar Music"
},
{
  "title": "Long Long Gone",
  "body": "I never tried as hard I could.\\I've seen more than I've understood.\\Take my father who came back from the dead,\\\"I needed just one more drink,\" he said.\\He sat there reading books,\\While my mother slowly lost her looks.\\And even though we were poor,\\The sun still shined on our door.O Lord, please come down from the mountain,\\Some of us are broke and having problems,\\And everybody knows, that I know what's going on\\And if cars could run on teardrops, I'd be long, long gone.I got a plan to get me out of debt,\\I'm gonna play the Superfecta bet,\\I'm gonna change the pattern of the stars\\I'd like to horsewhip all these vcrs\\Screw the soft rock and the salad bars\\Let's turn our backs on all the movie stars\\Let's raise our voices up and sing:\\\"We are not one with everything.\"O Lord, please come down from the mountain,\\Some of us are broke and having problems,\\And everybody knows, that I know what's going on\\And if cars could run on teardrops, I'd be long, long gone.\\Long, long gone.\\Long, long gone.© D.C.Berman, Civil Jar Music"
},
{
  "title": "I'm Getting Back Into Getting Back Into You",
  "body": "Baby won't you take this magnet and maybe put my picture back on the fridge.\\I must have been crazy, to let you get away like you did.\\And like a brown bird nesting in a Texaco sign I got a point of view,\\And the kicker is that, I'm getting back in getting back into you.I guess over time we became ducks, I never seemed to see you much.\\Then the world turned, time got away, we fell out of touch.\\I've been working at the airport bar, it's like Christmas in a submarine.\\Wings and brandy on a Winter's night: I guess you wouldn't call it a scene.Now my ex-wife's living in the suburbs with her guru and her mom.\\Now she finds her consolation in the stardust of a bong.\\You can call it a spinoff, say it's a knockoff, title it part two.\\But I'm getting back into getting back into getting back into you.\\I'm getting back into getting back into getting back into you.© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "People",
  "body": "Moments can be monuments to you\\If your life is interesting and true.\\It's just the same for a man or a girl,\\The meaning of the world lies outside the world. People love people and they understand\\if you wanna renovate your background mind\\(a federal woman needs a municipal man)\\people gotta synchronize to animal time. You can't change the feeling\\but you can change your feelings about the feelings in a second or two\\People always come around. I'm studying the ceiling on a little afternoon\\and when I paint my dining room\\people gonna come around. I love to see a rainbow from a garden hose\\lit up like the blood of a centerfold\\I love the city and the city rain,\\suburban kids with biblical names. People ask people to watch their scotch.\\People send people up to the moon.\\When they return, well there isn't much.\\People be careful not to crest too soon. The drums march along at the clip of an I.V. drip\\like sparks from a muffler dragged down the strip.\\I really hope you'll come around. It's sunny and 75. It feels so good to be alive.\\Come on baby don't stay inside.\\Everybody's coming out tonight.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Living Waters",
  "body": "Now people are good and people are bad\\and I'm never sure which one I am, so\\come in out of the storm\\what you need is an imitation of home, alright you're at home\\you're all alone\\and nobody's calling on the telephone People are good and people are bad\\people they butch, people they brag\\people they test, people they breast(?)\\people name sex as their favourite thing to doSo if you run, then run to me\\and if you can swim then swim to me\\just come in out of the storm\\what you need is an imitation of home you're at home\\you're all alone\\and nobody's calling on the telephone© D.C.Berman, Civil Jar Music"
},
{
  "title": "Sleeping is the Only Love",
  "body": "I heard they were taming the shrew.\\I heard the shrew was you.\\you might as well say fuck me cause I'm gonna keep on,\\keep on loving you.I'd crawl over fifty yards of broken glass\\just to hold on your hand.\\sleeping is the only love.\\sleeping is the only love.I had this friend, his name was Marc with a C.\\his sister was like the heat coming off the back of an old tv.\\their folks were slain in their Red Boiling Springs home.\\it was the worst of the Lord, some of the worst of the Lord.later I'd come to find\\life is sweeter than Jewish wine.\\give a box of candy or a foot massage.\\some people don't take the time.I'd crawl over fifty yards of burning coals\\just to make it with you.\\sleeping is the only love.\\sleeping is the only love.© D.C.Berman, Civil Jar Music/BMI"
},
{
  "title": "Inside the Golden Days of Missing You",
  "body": "Inside the golden days of missing you\\with the people of Cleveland\\who've suffered for so many years\\The shattered glass cussed\\and when it broke it spoke to us\\It said \"Hey\"\\It said \"I know you... what's your name?\" I wish they didn't set mirrors behind the bar\\cause I can't stand to look at my face\\when I don't know where you are\\Then the feeling fades away\\but you sort of wish it would of stayed\\inside... the golden days of missing you What if life is just some hard equation\\on a chalkboard in a science class for ghosts\\You can live again\\but you'll have to die twice in the end\\in the end/ we'll meet again© D.C.Berman, Civil Jar Music"
},
{
  "title": "I'm Gonna Love the Hell Out of You",
  "body": "I was 19, and dead from the neck up.\\She was a Christian rock ingenue.\\Sentimental as a cat's grave\\Her fucking body broke my eyes\\And she said, I'm gonna love the hell out of you.Brandy wine rained on an android cross\\Even the swans were bankrupt and blue\\I'd been a liar my whole life\\She said, I wanna be your wife\\And she said, I'm gonna love the hell out of you.In a lonely swedish bookstore, banging a librarian\\The sound of rain and lightning was my cue\\I fixed the Preakness in the rain\\I had a weakness for cocaine\\And she saidI learned double entry bookkeeping when I was 12 years old\\I learned there's no imagination in the blues\\They registered my name with the Catholic hall of fame\\And she said, I'm gonna love the hell out of you."
},
{
  "title": "Send in the Clouds",
  "body": "Send in the clouds. Bring down the rain.\\Shut all the blinds, turn out the lights:\\I feel insane when you get in my bed. I am the trick my mother played on the world\\Seventeen doctors couldn't decide\\whether I should be allowed in the game. Why can't monsters get along with other monsters?\\Soi disantra, soi disantra. I know a puppy who walked from Kentucky.\\Made to East Virginia by dawn.\\He had seventeen ideas in his head. Windex tears flow down the robot's face.\\He's never felt a lover's embrace.\\My momma named me after a king.\\I'm gonna bury my name in you. Why can't monsters get along with other monsters?\\Soi disantra, soi disantra.© D.C.Berman, Civil Jar Music"
},
{
  "title": "Horseleg Swastikas",
  "body": "I'm drunk on a couch in Nashville\\in a duplex near the reservoir\\and every single thought feels like a punch in the face\\I'm like a rabbit freezing on a starOn the wrong side of Sunday morning\\shattered in the terrible light\\working for a bankrupt circus\\on the wrong side of Saturday nightAnd I wanna be like water if I can\\cause water doesn't give a damnChased by a floating hatchet\\you can't just shoot your way out and go\\I can tell you things about this wallpaper\\that you'd never ever wanna knowThere's an altar in the valley\\for things in themselves as they are\\and the triumph of the obstacles\\and horseleg swastikasI wanna take a ride on the back of a sunbird\\up into the highest number© D.C.Berman, Civil Jar Music"
},
{
  "title": "Room Games and Diamond Rain",
  "body": "I'm gonna love you for a hundred years.\\Through suffering and celebration dear\\Cause only you can make my lies come true\\You can make lies real,\\You can make me feel,\\Like drinking wine in the shade all afternoonYou keep finding and reminding me,\\That you only can be kind to me,\\When you got with me you started dreaming my dreams.\\But darling, there's a gun in the garland,\\And you need to know,\\That the dream is not all dream.Chorus:\\Room games and diamond rain\\It's a fox hunt, it's a f-stop\\It's a ten acre wood.\\Outbound on a western train\\It costs a quarter man\\Out on the borderland\\And I can dance real good.A freight train rattles the chandelier,\\And if we're like plug-in reindeer,\\Whose cords can't stretch far enough to fly,\\We're gonna take a ride in the dirt,\\We're gonna die until it doesn't hurt,\\And then they can bury us side by side.(Chorus)© D.C.Berman, Civil Jar Music"
},
{
  "title": "Honk If You're Lonely",
  "body": "Radio's on, feeling all right\\Cruising the strip on a Saturday night.\\I smile and I wave and I hide all my pain\\but the sign on my bumper gives me away: Chorus::Honk if you're lonely tonight:If you need a friend to get through the night:A toot on your horn, a flash of your brights:Honk if you're lonely tonight. I know a honky-tonk where we can go.\\A booth in the back with the lights way down low.\\The jukebox is playing a sad melody\\for heart-broken lovers just like you and me. We'll laugh and we'll flirt and we'll dance every dance\\and before the night's over we'll make romance.\\The morning will find us with a smile on our face\\and we'll be together in a lover's embrace. (chorus) I know it seems sad to be so damn blue\\but there's always the chance that you'll meet someone new.\\I know that somewhere waiting for me\\is a sad lonely lover with a bumper that reads: (chorus) © D.C.Berman and Gate Pratt"
},
{
  "title": "Like like the the the Death",
  "body": "Like like the the the death\\Air crickets air crickets air crickets air crickets air Mother and child with magazine\\Into a story, into a dream\\Why is there something instead of nothing\\And how is the asking built into the hunting? Do you believe in MGM endings\\Everybody's coming back to Xmas for Texas\\Folks who've watched their mother kill an animal know\\That their home is surrounded by places to go\\(and the west has made a deal with the sun). My life at home every day:\\Drinking Coke in a kitchen with a dog\\Who doesn't even know his name.\\Oh right it could've been anyone\\Grass rabbits grass rabbits grass rabbits grass rabbits grass Nobody cares about a dead hooker\\Looking like one, standing for many\\Life finds a limit at the edge of our bodies\\A stranger begins wherever I see 'em. Let's live where the indoors and outdoors meet\\All the kids in the commonwealth are free.\\Every morning you forgive me, every evening you relive me\\And the pattern itself is what you give me\\(the morning has cut a deal with the east). Like like the the the death\\Air crickets air crickets air crickets air crickets air© D.C.Berman, Civil Jar Music"
},
{
  "title": "Albemarle Station",
  "body": "Call me from Albemarle Station if you can\\I hope you find your concentration beneath those ceiling fans\\We used to dance in this split-level ranch\\when moonlight flooded the room\\Now you're gone and the shades are all drawn\\in my air conditioned tomb Bad roads, bad snow, bad bridges\\could turn a once bad man religious\\if thy kingdom ever comes\\you better run, run run run There must be a spanish word for this feeling\\the rush I get when I am stealing\\from the Dust Congress\\whose dollars and dimes\\say \"in dust we trust\"\\oh yeah\\the world is not ready for you I passed an abandoned drive-in\\with ivy growing over the screen\\It was like I caught Hollywood sleeping-\\sleep without the dreams A magic shop in Colonial Watts\\something gets pushed by the wind\\The world's not ready\\the world's not ready\\the chimes of rabies are ringing again Bad roads, bad snow, bad bridges\\could turn a once bad man religious\\if thy kingdom ever comes\\you better run, run run run There must be a pool out behind the church\\cause he looked so cool in the back of a hearse\\After a debutante of his trial\\all the citizens began to dress in his style\\oh yeah, it's a beautiful, beautiful world© D.C.Berman, Civil Jar Music"
},
{
  "title": "Tennessee",
  "body": "I saw the river playing in the valley (C, Am, Em)\\Rushing round a bend and skipping stones (C, Am, Em)\\I saw the meadow wobble in the moonlight (C, Am, Em)\\I've come to get my girl and take her home. (C, Am, Em)Her doorbell plays a bar of Stephen Foster (Am, G, C)\\Her sister never left and look what it cost her (Am, G, C)\\We're gonna live in Nashville and I'll make a career (Am, G, C, Am)\\Out of writing sad songs and getting paid by the tear.Chorus::Marry me, leave Kentucky and come to Tennessee (G, C, G, D):Cause you're the only ten I see, you're the only ten I see. (G, C, D):I've looked through offices and honkytonks for a man man enough to be (G, C, G, D):Mr. and Mrs. Tennessee, Mr. and Mrs. Tennessee (G, C, D)Punk rock died when the first kid said (C, Am, Em)\\\"Punk's not dead, punk's not dead\" (C, Am, Em)\\You know Louisville is death we've got to up and move (C, Am, Em)\\Because the dead do not improve. (C, Am, Em)Goodbye users and suckers and steady bad luckers (Am, G, C)\\We're off to the land of club soda unbridled (Am, G, C)\\We're off to the land of hot middle-aged women (Am, G, C)\\We're off to the land whose blood runneth orange. (Am, G, C)(chorus)© D.C.Berman, Civil Jar Music"
},
{
  "title": "Advice to the Graduate",
  "body": "If you got a message\\leave your name and number\\and we'll get back to youSleep on your back,\\put ash in your shoes\\and always use the old sense of the words.\\Your third drink will lead you astray\\wandering down the backstreets of the world.On the last day of your life\\don't forget to die,\\the things that you do will always make your momma cry\\Oh I know you got a lot of hope for\\the new men x2.So you got no friends and you wander through the night,\\now you watch the sun rise through a rifle sight.\\Well don't believe in people who say it's all been done,\\they have time to talk because their race is run.\\So get in some licks and hold your head up\\& soon you'll be drinking from that crystal cup. (Repeat chorus) Good morning to the new world.......© D.C.Berman, Civil Jar Music"
}
]